{
  "component-definition": {
    "uuid": "b187caad-212a-4645-81e1-f7d9dff133c6",
    "metadata": {
      "title": "Ilias Learning Management System (LMS)",
      "published": "2021-08-22T19:49:48.074466+00:00",
      "last-modified": "2021-08-22T19:49:48.074470+00:00",
      "version": "unknown",
      "oscal-version": "1.0.0"
    },
    "components": [
      {
        "uuid": "018d971e-28b8-4fcf-b61e-5fd3745088b8",
        "type": "software",
        "title": "Ilias",
        "description": "Ilias",
        "control-implementations": [
          {
            "uuid": "0f920407-8be9-4753-855a-bc7cdbf6a078",
            "source": "NIST_SP80053r4",
            "description": "NIST_SP80053r4",
            "implemented-requirements": [
              {
                "uuid": "8e2f6eb9-fca8-48ad-bf8a-1c202a31052d",
                "control-id": "ac-2",
                "description": "ac-2 statements",
                "statements": [
                  {
                    "statement-id": "ac-2_smt.a",
                    "uuid": "7a6ad6ad-58d0-451a-9c3d-e9b0f373f22b",
                    "description": "Ilias provides user accounts for individuals who participate in visiting, contributing to and administering the site with the following roles:\n- Anonymous user – Readers of the site who either do not have an account or are not logged in.\n- Guest – This role has limited visibility and read permissions\n- User - Standard role for registered users. This role grants read access to most objects.\n- Administrator - This role has all permissions enabled by default."
                  },
                  {
                    "statement-id": "ac-2_smt.d",
                    "uuid": "57db505c-377e-4047-a55b-adef9b2f0569",
                    "description": "Ilias' permissions and role-based access controls are built-in. Each role within Ilias can only access the pages and controls for which their privilege allows."
                  },
                  {
                    "statement-id": "ac-2_smt.g",
                    "uuid": "1f62e514-824e-49b1-b7ac-5a209677b6af",
                    "description": "Ilias monitors the usage of information accounts in a log on the server."
                  }
                ]
              },
              {
                "uuid": "ab10214f-cbd8-4602-8961-ffb7a525409d",
                "control-id": "ac-3",
                "description": "ac-3 statements",
                "statements": [
                  {
                    "statement-id": "ac-3_smt",
                    "uuid": "65eece0a-eea0-4f24-acb4-32181c865ed8",
                    "description": "Access control in Ilias is enforced by authentication via Shibboleth single sing on (SSO) for every type of user except Anonymous user. The user’s privileges, permissions, and access are provided on the principle of least privilege.\nThe anonymous user role has the least access to the site of all roles. The website does not allow anonymous users to register an account for themselves. Project Administrators, HR Managers, and Org Managers are the only roles that can create new user accounts."
                  }
                ]
              },
              {
                "uuid": "69eba16e-c561-4e06-aaa6-bf5a400f27ab",
                "control-id": "ac-8",
                "description": "ac-8 statements",
                "statements": [
                  {
                    "statement-id": "ac-8_smt",
                    "uuid": "8bbb4519-bdd3-4f11-87a6-e9f6a7f71337",
                    "description": "System Use Notification is inherited from the Project."
                  }
                ]
              },
              {
                "uuid": "ad6a854a-9818-4d43-85df-873e76754463",
                "control-id": "ac-14",
                "description": "ac-14 statements",
                "statements": [
                  {
                    "statement-id": "ac-14_smt",
                    "uuid": "8a35e5ea-3dac-4f0a-86bb-dea9814c0ee2",
                    "description": "The anonymous user role has the least access to the site of all roles. The website does not allow anonymous users to register an account for themselves."
                  }
                ]
              },
              {
                "uuid": "f1d543b7-4a14-42ea-b01a-80f351ed026e",
                "control-id": "au-2",
                "description": "au-2 statements",
                "statements": [
                  {
                    "statement-id": "au-2_smt.a",
                    "uuid": "2b45a0be-ccc0-4aff-9bb3-da0c20fc87d5",
                    "description": "Transaction logs are generated by the Apache web server, Ilias CMS, MySQL database and PHP page processing. Specifically, the following server, application, database and network device audit log events are captured:\n- Apache access log: Contains a list of requests for your website that have bypassed Varnish. These requests include pages, theme files, and static media files.\n- Apache error log: Records any Apache-level issues. The issues reported here are usually caused by general server issues, including capacity problems, .htaccess problems, and missing files.\n- Ilias page request log: Records all Ilias page loads on your website.\n- Ilias log: Records Ilias-related actions on your website. The log is recorded on your server.\n- MySQL slow query log: Contains a list of MySQL queries that have taken longer than one second to complete.\n- PHP error log: Records any issues that occur during the PHP processing portion of a page load. Issues reported here are usually caused by a website’s code, configuration, or content."
                  },
                  {
                    "statement-id": "au-2_smt.b",
                    "uuid": "2d8bcf60-03ad-46b7-9024-716de382d6d8",
                    "description": "All security-related issues and events, including requests for server log analysis, are recorded in CivicActions' JIRA tracking system."
                  },
                  {
                    "statement-id": "au-2_smt.c",
                    "uuid": "3c802c10-527a-4369-9458-3afdeba43da3",
                    "description": "CivicActions has extensive experience and specialization as a host of websites that are built using the Ilias web learning platform. Should the need for additional logging become evident, we have the ability to do so by modifying the website's source code to insert additional Ilias logging hooks."
                  },
                  {
                    "statement-id": "au-2_smt.d",
                    "uuid": "d1c838a3-ebac-4794-8d36-d52b448abf9c",
                    "description": "Information captured in the transaction logs includes, but is not limited to, the following auditable events:\n- Failed login attempts\n- Successful login attempts\n- New user account creation\n- Password reset instructions mailed\n- User logins via a one-time login link\n- Content creation\n- Content publishing\n- Web page not found\n- Website configuration changes\n- System administration activities\n- Slow query logs.\n- PHP error logs: Captures any errors logged during execution of the PHP programming\n  language."
                  }
                ]
              },
              {
                "uuid": "eeab5eac-e0c1-4871-8cbc-2c0283c7077a",
                "control-id": "au-3",
                "description": "au-3 statements",
                "statements": [
                  {
                    "statement-id": "au-3_smt",
                    "uuid": "74ada6a6-597a-40e5-ab85-c9ca5cc52660",
                    "description": "The logs collected for Ilias sites include the following types of information:\n- IP number of the request originator\n- Timestamp\n- Username\n- Ilias log message (if applicable)\n- Unique numerical ID of the content being modified (for content creation, modification and deletion events)\nWhen auditing an Ilias incident, CivicActions' developers aggregate log sources from multiple servers into the Graylog dashboard so that all log entries for a single managed security incident can be analyzed in a single document. Log sources are sorted, filtered and reviewed. Application logs are maintained primarily for an after-the-fact investigation of critical systems or security events."
                  }
                ]
              },
              {
                "uuid": "025e6a26-5b4b-45e6-9c36-8012d3ffda25",
                "control-id": "ca-7",
                "description": "ca-7 statements",
                "statements": [
                  {
                    "statement-id": "ca-7_smt.a",
                    "uuid": "c71c4fa1-d444-405d-ae2e-03ded063fe16",
                    "description": "CivicActions follows recommendations and best practices developed by the Ilias community for monitoring. Examples of specific logs and metrics are included in AU-2 and AU-3."
                  },
                  {
                    "statement-id": "ca-7_smt.c",
                    "uuid": "dd9661e1-caaf-4f56-bd0c-a38c1fc5dcf5",
                    "description": "CivicActions works closely with the Ilias security community and reviews security announcements as part of the continuous monitoring strategy. Items found to require immediate remediation will be addressed."
                  }
                ]
              },
              {
                "uuid": "7765d83d-82df-424c-ac9d-53ded90f287c",
                "control-id": "cm-2",
                "description": "cm-2 statements",
                "statements": [
                  {
                    "statement-id": "cm-2_smt",
                    "uuid": "cd611716-5688-41e4-a742-e7b1b3e0960d",
                    "description": "The baseline configuration is maintained in Git and described in the Configuration Management Plan, which describes the change workflow and software configuration. In the context of Security Configuration Management, the baseline configuration is a collection of formally approved configuration state(s) of one or more configuration items (\"features\") that compose the system. The baseline configuration is used to restore and serves as the basis against which the next change or set of changes to the system is made.\nThe features for the system are maintained in the website's source code, which is managed in Git, a source code version control system. Once the source code is updated, Git maintains the new version of staged code once committed in the Git repository as the new baseline. All code prior to it being staged is documented, tested and approved by CivicActions Development, which is described in control SA-3. The production environment is configured to take database snapshots daily."
                  }
                ]
              },
              {
                "uuid": "2ff2a45b-dfc4-47ad-9213-bac83ad360a3",
                "control-id": "cm-8",
                "description": "cm-8 statements",
                "statements": [
                  {
                    "statement-id": "cm-8_smt",
                    "uuid": "2d81977d-cf99-486b-9df3-02cdab9c03af",
                    "description": "The software inventory for the application is maintained in the codebase stored CivicActions' Git source code version control system. It consists of the following components:\n- The Ilias open-source web learning management system\n- Ilias add-on modules, themes, and libraries available from the Ilias.de website which extend Ilias core\n- Custom code written by CivicActions' developers\nThe inventory is reviewed monthly by CivicActions Product Engineering teams in accordance with the Configuration Management Plan.\nWebsite content is backed up daily using CPM snapshots. This allows CivicActions to build an inventory of the system on demand."
                  }
                ]
              },
              {
                "uuid": "460df6a7-19f9-44da-89ec-f01d836a84d1",
                "control-id": "cm-10",
                "description": "cm-10 statements",
                "statements": [
                  {
                    "statement-id": "cm-10_smt",
                    "uuid": "001d9cc3-00d0-41cc-b41a-f33cf3f83f4e",
                    "description": "Ilias is hosted on a LAMP platform (Linux, Apache, MySQL, and PHP). These are all compatible with the Free Software Foundation's General Public License (GPL) version 2 or later and are freely available for use under copyright law."
                  }
                ]
              },
              {
                "uuid": "31f4f5e2-cb60-4536-b7d9-6da024a1cbd8",
                "control-id": "ia-4",
                "description": "ia-4 statements",
                "statements": [
                  {
                    "statement-id": "ia-4_smt.a",
                    "uuid": "705fcb25-8c14-4ade-bba0-72bafc1d8e67",
                    "description": "Upon account creation, the Ilias software assigns each user account a unique numerical user ID (UID). This UID is used internally by the system to track user actions such as content creation or editing. The numerical user IDs are never reused even if their user accounts are subsequently blocked or deleted."
                  },
                  {
                    "statement-id": "ia-4_smt.b",
                    "uuid": "7ef99f53-4893-43ee-b0be-0b2816724a29",
                    "description": "When Ilias user accounts are created, users' email addresses are verified by sending a single-use activation link to the user’s mailbox. The email recipient then uses the activation link to log in to the website and supply a password which must meet the system's password complexity requirements."
                  },
                  {
                    "statement-id": "ia-4_smt.c",
                    "uuid": "6342e1af-b8c3-47ba-b979-964ae52225f8",
                    "description": "Identifiers for CivicActions internal personnel include a username based on the individual's full first and last name and are reviewed for uniqueness by the admin group when it approves the creation of the user account."
                  },
                  {
                    "statement-id": "ia-4_smt.d",
                    "uuid": "9f22972e-30ad-48dd-8173-738ba8eb68c4",
                    "description": "Ilias user's unique identifier (the numeric user ID, or UID) is never reused."
                  }
                ]
              },
              {
                "uuid": "e722e22b-cfbd-4100-89f7-76f76933e5ab",
                "control-id": "ia-5",
                "description": "ia-5 statements",
                "statements": [
                  {
                    "statement-id": "ia-5_smt.a",
                    "uuid": "8f4711fb-d6fc-4bb7-bead-298da20e1a61",
                    "description": "Refer to control AC-2 in this SSP for further details on account provisioning.\nCivicActions will create and maintain an initial Ilias Administrator (highest level of Ilias Account). New Administrators are able to provide additional Administrator access at their own discretion and are ultimately responsible for managing their own Administrator and other user accounts that they create."
                  },
                  {
                    "statement-id": "ia-5_smt.b",
                    "uuid": "e6624092-af46-4538-b398-ffd53c2b20c8",
                    "description": "Initial authenticator content (a unique email address – not previously used in any other account) is provided by the user. Internal initial password requirements set by CivicActions Operations and ongoing password refreshes by internal users follow the requirements set in the Identification and Authentication Policy."
                  },
                  {
                    "statement-id": "ia-5_smt.c",
                    "uuid": "4826f08e-9eb2-43ad-9579-d99ebf708315",
                    "description": "The system partially inherits this control from Ilias standard password strength mechanisms."
                  },
                  {
                    "statement-id": "ia-5_smt.d",
                    "uuid": "593df707-044d-4105-90a3-94f64ce87e6d",
                    "description": "The system partially inherits this control from Ilias standard password management.\nAll password creation/change/reset operations are recorded in the website's Ilias logs."
                  },
                  {
                    "statement-id": "ia-5_smt.e",
                    "uuid": "c538b73d-caf2-4b62-8678-4f6719fa3232",
                    "description": "Ilias requires users to change their password upon initial login, and the application website enforces this. Each user account is assigned a default password that is randomly generated, not possible to guess, and not shared with anyone, including site administrators. When the user logs in and creates a new password, the default password is erased from the website database."
                  },
                  {
                    "statement-id": "ia-5_smt.h",
                    "uuid": "ebb412d0-35db-4f6e-a946-9bbf76e4e541",
                    "description": "For all Ilias users, passwords are protected by the website's software, which only stores an encrypted string based on the password. This means that even if the website's database should be compromised, an attacker would still be unable to know users' actual passwords. Internal users receive training in security awareness and acceptable use and are instructed never to reveal their passwords to anyone."
                  },
                  {
                    "statement-id": "ia-5_smt.i",
                    "uuid": "c1d249cc-2203-4b16-8ca8-19c382583c89",
                    "description": "Ilias users are required to take appropriate measures in the handling of passwords including:\n- Not transmitting user names and passwords together in an unencrypted format\n- Not permitting the sending of passwords in an unencrypted format via email\n- Not listing passwords in tickets\n- Not writing down or storing passwords in a readable form in any physical or logical location where they may be discoverable by unauthorized persons."
                  },
                  {
                    "statement-id": "ia-5_smt.j",
                    "uuid": "66b06e34-daa8-4b39-a24f-4a51db77d49f",
                    "description": "This control is not applicable due to the fact that group accounts are not created within the Ilias application per IA Policy."
                  }
                ]
              },
              {
                "uuid": "a9f453d2-00ee-4baa-8049-c44e1c13db35",
                "control-id": "ia-5.1",
                "description": "ia-5.1 statements",
                "statements": [
                  {
                    "statement-id": "ia-5.1_smt.a",
                    "uuid": "78f13543-b1d6-4dc1-abf5-d1a85410c4d8",
                    "description": "Ilias supports the requirement for password-based authentication complexity. New users of Ilias are required to specify their password authentication as soon as they log in to the website for the first. The website requires all submitted passwords to comply with validation rules, as described above in IA-5(c).\nChanging password lifetime, length, reuse or strength requirements requires a code setting change that therefore needs to be planned and approved by {'name': 'CivicActions, Inc', 'name_short': 'CivicActions', 'address': {'street': '3527 Mt Diablo Blvd, Unit 269', 'city': 'Lafayette', 'state': 'CA', 'zip': 94549, 'country': None}, 'phone': '510-408-7510', 'website': 'www.civicactions.com', 'compliance_docs_url': 'https://github.com/CivicActions/compliance-docs', 'email_support': 'support@civicactions.com', 'security_policy_url': 'https://github.com/CivicActions/security-policy'}' Change Control Board before being implemented."
                  },
                  {
                    "statement-id": "ia-5.1_smt.b",
                    "uuid": "256cbf80-e3d2-4932-acaf-8f09e6f1c9f1",
                    "description": "When required to change passwords, Ilias users are required to change their authenticator password by changing at least one character. Enforcement of this control is implemented through the website's software configuration."
                  },
                  {
                    "statement-id": "ia-5.1_smt.c",
                    "uuid": "bb894543-2cdb-4725-abcb-33d56628b45c",
                    "description": "All Ilias passwords are encrypted in storage, using the SHA-512 hashing algorithm with a salt. The hash function is performed repeatedly to further obfuscate the password via key stretching. In transmission, passwords are encrypted using SSL via HTTPS."
                  },
                  {
                    "statement-id": "ia-5.1_smt.d",
                    "uuid": "4e8d4690-25da-4c7d-a31a-773ef3ee58ac",
                    "description": "The website requires all submitted passwords to comply with lifetime rules, as described above in IA-5(g)."
                  },
                  {
                    "statement-id": "ia-5.1_smt.e",
                    "uuid": "fac2a92d-4591-48da-a29d-f237f84d0482",
                    "description": "Password reuse is limited through software configuration."
                  },
                  {
                    "statement-id": "ia-5.1_smt.f",
                    "uuid": "8f749971-f899-4771-a0d6-0bdf07d84181",
                    "description": "When website users request a password reset, the website sends a temporary login link to the email address associated with their user account. After a user logs in via the temporary login link, the website requires the user to enter a new password before proceeding further."
                  }
                ]
              },
              {
                "uuid": "0be66963-2a8d-46a2-8ea7-fd0b9d5b5ffc",
                "control-id": "ia-6",
                "description": "ia-6 statements",
                "statements": [
                  {
                    "statement-id": "ia-6_smt",
                    "uuid": "80e502cb-bd0c-4bf6-a677-af5d42a96971",
                    "description": "Feedback of authentication information is obscured during the authentication process into the Ilias application by displaying “dots” in the place of a password, as is standard for web-based applications. In transmission, passwords are encrypted using SSL via HTTPS."
                  }
                ]
              },
              {
                "uuid": "48100aaa-1f3e-41af-93cc-73d2a710a937",
                "control-id": "ia-7",
                "description": "ia-7 statements",
                "statements": [
                  {
                    "statement-id": "ia-7_smt",
                    "uuid": "9a827270-92cc-4b83-a9db-a6d85c9ddab7",
                    "description": "All Ilias passwords are encrypted in storage, using the SHA-512 hashing algorithm with a salt. SHA-512 is an approved security function under FIPS PUB 140-2. The hash function is performed repeatedly to further obfuscate the password via key stretching. In transmission, passwords are encrypted using SSL via HTTPS."
                  }
                ]
              },
              {
                "uuid": "3520e223-f1ce-4262-a7b3-0b46e2ab84e1",
                "control-id": "sa-5",
                "description": "sa-5 statements",
                "statements": [
                  {
                    "statement-id": "sa-5_smt.a",
                    "uuid": "7d3b511a-8488-4c2a-bf09-fbbaa7323cef",
                    "description": "Public documentation related to Ilias is maintained by the Ilias Association and is located at <https://Ilias.de/documentation>. This documentation contains administrator documentation for the information system that describes:\n- secure configuration, installation, and operation of the system, component, or service;\n- effective use and maintenance of security functions/mechanisms; and\n- known vulnerabilities regarding configuration and use of administrative functions;"
                  },
                  {
                    "statement-id": "sa-5_smt.b",
                    "uuid": "bc1d838d-f142-48e3-ab1e-c74f26ef9019",
                    "description": "The public documentation at Ilias.de contains user documentation for the information system that describes:\n- user-accessible security functions/mechanisms and how to effectively use those\n  security functions/mechanisms;\n- methods for user interaction, which enables individuals to use the system,\n  component, or service in a more secure manner; and\n- user responsibilities in maintaining the security of the system, component, or service;"
                  },
                  {
                    "statement-id": "sa-5_smt.c",
                    "uuid": "6b521705-a295-4d6c-8851-c4e2762d58e0",
                    "description": "As a popular and well-used and maintained free and open source (FOSS) project, in the event that sought after documentation is not available on Ilias.de, it can usually be found in one of the many forums, mailing lists or Stack Exchange sites covering Ilias and its many contributed modules."
                  },
                  {
                    "statement-id": "sa-5_smt.d",
                    "uuid": "2cd3cc2b-4978-4b17-837b-3abf5200db33",
                    "description": "The Ilias.de documentation is multi-sourced on GitHub and private repositories."
                  },
                  {
                    "statement-id": "sa-5_smt.e",
                    "uuid": "47991e3e-9d5d-4429-a797-5c0a49463f18",
                    "description": "As the Ilias.de documentation is publicly available, there is no need to provide distribution mechanisms."
                  }
                ]
              },
              {
                "uuid": "d3a0ada2-5047-4de0-a4e3-02bb1e8000f3",
                "control-id": "sc-5",
                "description": "sc-5 statements",
                "statements": [
                  {
                    "statement-id": "sc-5_smt",
                    "uuid": "4ac8d16d-39c3-454c-92a0-de9996bb85ca",
                    "description": "Ilias has a manual ability to block IP addresses in cases where attacks bypass cloud protection. This is managed by CivicActions Operations."
                  }
                ]
              },
              {
                "uuid": "897eb763-e26f-4dcf-849a-65386cd8a2f3",
                "control-id": "sc-7",
                "description": "sc-7 statements",
                "statements": [
                  {
                    "statement-id": "sc-7_smt",
                    "uuid": "9c05c39f-8a4c-4712-827c-bf4bf75010fd",
                    "description": "Ilias, when deployed on SELinux in full enforcing mode, minimizes the number of services and computing nodes that are exposed to the Internet. Ilias employs both the AWS platform safeguards and the Ilias logging in monitoring and recording system events. All other computing nodes used in the system are isolated within AWS."
                  }
                ]
              },
              {
                "uuid": "60116ae7-44d9-430c-9115-d1f8f7833f91",
                "control-id": "si-2",
                "description": "si-2 statements",
                "statements": [
                  {
                    "statement-id": "si-2_smt",
                    "uuid": "77dd842b-0ad0-4b28-ac82-e3ae50d51b4b",
                    "description": "Ilias contains built-in security status monitoring of the core application and contributed modules."
                  }
                ]
              },
              {
                "uuid": "90b5ecba-4a58-479f-9a5d-1eb833b0d099",
                "control-id": "si-5",
                "description": "si-5 statements",
                "statements": [
                  {
                    "statement-id": "si-5_smt",
                    "uuid": "843bc75c-9f69-4fd7-bb28-ea9bbd26dd60",
                    "description": "CivicActions Security and Operations receive Ilias Security Advisories on a regular basis."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}
