{
  "component-definition": {
    "uuid": "deba712a-2b52-4be5-a246-95a015774c2d",
    "metadata": {
      "title": "Project-specific Responsibilities",
      "published": "2021-08-22T19:51:04.447078+00:00",
      "last-modified": "2021-08-22T19:51:04.447082+00:00",
      "version": "unknown",
      "oscal-version": "1.0.0"
    },
    "components": [
      {
        "uuid": "c863bc57-6f44-44dd-a691-73b998c046d0",
        "type": "software",
        "title": "Project",
        "description": "Project",
        "control-implementations": [
          {
            "uuid": "161527eb-c660-41ce-a901-3cc526e8ca36",
            "source": "NIST_SP80053r4",
            "description": "NIST_SP80053r4",
            "implemented-requirements": [
              {
                "uuid": "190d1a2c-ab87-46b7-9f5f-7c2eb7b7493b",
                "control-id": "ac-1",
                "description": "ac-1 statements",
                "statements": [
                  {
                    "statement-id": "ac-1_smt",
                    "uuid": "68eca839-5540-4d72-b661-1d4e8d6b3eda",
                    "description": "This is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nAccess control policy and procedures are documented in the The Project SSP. Access to Project operational information or system resources is limited to only authorized users, programs or processes. The Department enforces access control policies to protect the integrity of the The Project. This Department reviews and updates this policy as necessary and it has been being updated, as necessary, since April 2008."
                  }
                ]
              },
              {
                "uuid": "f8197273-218a-406c-8df1-461b41264df2",
                "control-id": "ac-2",
                "description": "ac-2 statements",
                "statements": [
                  {
                    "statement-id": "ac-2_smt.a",
                    "uuid": "d6f5afc1-577a-4ea7-ba43-7f210f488abb",
                    "description": "SSH system accounts are provided to contractors on an as-needed basis.\n\nAccess privileges are used to ensure that only authorized personnel access certain areas of the Project system. User access is controlled by the completion and submission of Project system Rules of Behavior and New User Account Request forms by the user and management. These items are completed and submitted whenever a new user requires access or an existing user requires access changes. The system administrator, based on need-to-know, assigns the proper permissions. The employee’s manager approves the access rights before the initial account is created. Finally, the system administrator implements the access rights according to the New User Account Request form. The security staff and the support contractor review accounts periodically. Accounts no longer in use are removed from the system by the system administrator.\n\nThe Project has implemented user account procedures to disable inactive user accounts after 90-days of inactivity. The Project support staff monitors all user accounts to ensure this procedure is enforced. Section 6.3, Authentication Management, of the Project SSP illustrates the exact procedures the contractor support staff follows to ensure accounts are properly managed.\nThe Project system does not have guest or anonymous accounts."
                  },
                  {
                    "statement-id": "ac-2_smt.b",
                    "uuid": "b42d44be-0509-4a22-97ae-aad04e70425b",
                    "description": "The system Owner has oversight over all permissions that the Project Manager and Operations Staff manages."
                  },
                  {
                    "statement-id": "ac-2_smt.c",
                    "uuid": "182eeb7e-fde5-4d9b-a77f-274c65920c79",
                    "description": "In accordance with Project Access Control Policy, Project group membership is determined according to the individual's position and role within the organization. A ticket request is used to request accounts and group membership. The request is authorized by the appropriate manager."
                  },
                  {
                    "statement-id": "ac-2_smt.d",
                    "uuid": "4ff3e595-8d29-465b-91ee-6260b05a987f",
                    "description": "Project user privileges vary depending on the type of user role assigned. Only users with the role of Administrator have the ability to create and modify user roles for other users."
                  },
                  {
                    "statement-id": "ac-2_smt.e",
                    "uuid": "acccbcee-dbf5-402a-aa72-75806fa40e50",
                    "description": "The System Owner approves, and CivicActions Operations set up the initial Administrator account for Project. Subsequent client access and related approvals are managed by CivicActions Operations in collaboration with the System Owner."
                  },
                  {
                    "statement-id": "ac-2_smt.i",
                    "uuid": "6d20a0c8-e7d8-404c-85ef-ed795e185930",
                    "description": "Project governs their own administrative access. Users with\nthe Administrator roles are empowered to designate and approve\nAdministrators."
                  },
                  {
                    "statement-id": "ac-2_smt.j",
                    "uuid": "7a2928e5-3368-4387-be1e-64f21126e3f6",
                    "description": "Administrators are empowered to and responsible for reviewing their own accounts and determining whether the accounts should still be authorized."
                  }
                ]
              },
              {
                "uuid": "b5e2551f-e8da-4b0d-870b-d0a296fdfff6",
                "control-id": "ac-3",
                "description": "ac-3 statements",
                "statements": [
                  {
                    "statement-id": "ac-3_smt",
                    "uuid": "340ba346-0470-4daf-b3e5-a0261301429b",
                    "description": "The The Project ensures that assigned authorizations for controlling access to the system is enforced in accordance with the user definitions noted in Section 1.1.1 of the Project SSP. The technical support staff ensures that access to security functions and protected information is restricted to authorized personnel. Access will be controlled with access control list used on each instance. Members of one group cannot access resources defined for other groups unless explicitly permitted."
                  }
                ]
              },
              {
                "uuid": "43536680-b2c7-407d-9a3f-13d2c6d1a515",
                "control-id": "ac-7",
                "description": "ac-7 statements",
                "statements": [
                  {
                    "statement-id": "ac-7_smt",
                    "uuid": "62a373d2-5099-4663-a5e0-544a97108fd8",
                    "description": "The Project system locks out users after three unsuccessful login attempts. The information system automatically locks the account permanently, unless an administrator unlocks the account before then, when the maximum number of unsuccessful attempts (3) is exceeded."
                  }
                ]
              },
              {
                "uuid": "4b4a2ca3-3dcd-4090-98b5-1b6724a513b2",
                "control-id": "ac-8",
                "description": "ac-8 statements",
                "statements": [
                  {
                    "statement-id": "ac-8_smt",
                    "uuid": "bcc1457d-0f44-4126-99dc-717ada53a4ac",
                    "description": "A warning banner ensures that all persons attempting to gain access to the system know that the system and its information are “Authorized User Only” and that attempts to illegally log on to the system could lead to criminal prosecution. The warning message displayed notifies unauthorized users that they have accessed a U.S. Government computer system and continued, unauthorized use can be punishable by fines or imprisonment. Each device logged into will display a system use notification message before the log in window is displayed. The system use notification banner will remain on the screen until the user takes an explicit action to log on to the device. The following is the notification banner displayed on all system instances:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n- The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n- At any time, the USG may inspect and seize data stored on this IS.\n- Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n- This IS includes security measures (e.g., authentication and access controls) to protect USG interests -- not for your personal benefit or privacy.\n- Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\""
                  }
                ]
              },
              {
                "uuid": "10210204-0fab-47a2-8d15-ad9c9f6a652b",
                "control-id": "ac-14",
                "description": "ac-14 statements",
                "statements": [
                  {
                    "statement-id": "ac-14_smt",
                    "uuid": "34d9530a-715f-4a44-9443-2f6731fe0451",
                    "description": "The The Project allows the general public user to read the web pages, do searches on the resource database and to review online forum information without identification and authentication for the public web site. Program and Privilege users cannot access the Project system without identification or authentication."
                  }
                ]
              },
              {
                "uuid": "6e59aaa4-8466-428f-acfa-27f2a632a3d7",
                "control-id": "ac-17",
                "description": "ac-17 statements",
                "statements": [
                  {
                    "statement-id": "ac-17_smt",
                    "uuid": "7f9c8902-9a4a-4b0b-bb75-ceb3f656bcd8",
                    "description": "The The Project permits remote access for privileged functions to support operational needs. The technical staff documents, monitors, and controls all methods of remote access to the information system including remote access for privileged functions. Privileged user access is only permitted through the use of Secure Shell (SSH) where the user will authenticate to the device through this secure channel. Virtual Private Networking (VPN) is not enabled in any form within the Project accreditation boundary."
                  }
                ]
              },
              {
                "uuid": "ead09d1b-416c-4bc6-acad-017d05136634",
                "control-id": "ac-22",
                "description": "ac-22 statements",
                "statements": [
                  {
                    "statement-id": "ac-22_smt.a",
                    "uuid": "c29dd23c-409e-444c-877f-45191dc1a575",
                    "description": "The The Client grants certain Project support staff members the authority to post publicly accessible content. These individuals must complete Project system security training before being granted access to the Project and before they can post publicly accessible content within the The Project. Furthermore, each authorized individual must follow the procedures delineated within the “Using Drupal” Instruction to ensure they are following a verifiable procedure throughout the entire process. This covers the Project Discussion Lists administration areas, Project Quarterly Reporting and training tools, and Drupal Content Management systems. Public content is only edited via the Drupal Content Management System. All other content is only viewable by Project system users and protected by hardened access controls."
                  },
                  {
                    "statement-id": "ac-22_smt.b",
                    "uuid": "8447eff7-da49-4332-9bd0-5a0d1e41ea86",
                    "description": "It is the Project responsibility to train authorized Project individuals ensuring publicly accessible information does not contain nonpublic information."
                  },
                  {
                    "statement-id": "ac-22_smt.c",
                    "uuid": "a3fafbba-d611-4483-aa9d-8a04976c10f2",
                    "description": "Authorized Project individuals review the proposed content of information prior to posting onto the publicly accessible information system to ensure that nonpublic information is not included.\n\nProject Users have been authorized for creation of publicly accessible content with publishing authority from an Administrator role. The publishing authority ensures the information being published does not contain nonpublic information."
                  },
                  {
                    "statement-id": "ac-22_smt.d",
                    "uuid": "71829012-2fac-4b21-b608-1fae2a20a905",
                    "description": "Authorized Project individuals review the content on the publicly accessible information system for nonpublic information at least every 365 days and removes such information."
                  }
                ]
              },
              {
                "uuid": "8f63a3e1-8610-44d5-8bac-a70a458ce442",
                "control-id": "at-1",
                "description": "at-1 statements",
                "statements": [
                  {
                    "statement-id": "at-1_smt",
                    "uuid": "dec03131-a4ee-4f15-a603-e68fc577cef3",
                    "description": "Security awareness and training policy and procedures are formally documented in None, which provides the roles and responsibilities as it pertains to security awareness and training. The Department will ensure all users, including managers and senior executives, are exposed to basic information system security awareness materials before authorizing access to the system and at least annually thereafter. Client documents and monitors all individual information system security training activities including basic security awareness training. OMB reviews and updates the policy as necessary."
                  }
                ]
              },
              {
                "uuid": "f0b4b9c5-a04e-454e-b5a3-5c458aab388a",
                "control-id": "at-2",
                "description": "at-2 statements",
                "statements": [
                  {
                    "statement-id": "at-2_smt",
                    "uuid": "9c2f663b-588c-427c-bb01-157ba3a614cc",
                    "description": "Client personnel and contractor employees involved with the management, operation, programming, maintenance, or use of Project system receive training in acceptable computer security practices prior to system access. All Client employees and contractors are required to complete annual IT security awareness training. This security awareness training covers issues and policies associated with information security, including end user security roles and responsibilities and rules of behavior. Some topics addressed in the training are:\n\n- Password protection\n- System rules of behavior\n- Protection of hardware, software, and data\n- Proper handling of copyrighted materials\n- Reporting of security breaches and violations\n- Proper procedures for software installation, uploading, and use on\n  workstations."
                  }
                ]
              },
              {
                "uuid": "60c53992-5072-4bcc-a16d-0c980a5ffe70",
                "control-id": "at-3",
                "description": "at-3 statements",
                "statements": [
                  {
                    "statement-id": "at-3_smt",
                    "uuid": "98d854f9-9475-40b9-b887-290e758b44b6",
                    "description": "Completion of role-based training is an annual requirement for personnel in roles with significant information security responsibilities that require specialized role-based training. Role-based cybersecurity training is developed and implemented to meet identified training needs and competencies associated with the various target audiences/functional roles (federal and contractor employees) that comprise the Client workforce, as is identified in and required by the FISMA and OMB A-130, Appendix III. The appropriate content of security training is determined based on the assigned roles and responsibilities of individuals and the specific security requirements of the Department, PO and the information systems to which personnel have authorized access. Annual training requirements may be met by completing one or more course(s) within the Department’s learning management systems, participating in instructor-led training provided by the OCIO, or completing an external role-based course or courses offered within their specific functional area of expertise."
                  }
                ]
              },
              {
                "uuid": "418d60e1-0227-4b08-825a-1d346f16c8f0",
                "control-id": "at-4",
                "description": "at-4 statements",
                "statements": [
                  {
                    "statement-id": "at-4_smt.a",
                    "uuid": "30dd5c3c-cdcd-4aae-b93f-958b3ca2ed88",
                    "description": "Client documents and monitors all individual information system security training activities including basic security awareness training. New users are required to take security training within 30 days of hire. This information is kept in the appropriate personnel files to verify users have met the training requirements. Training requirement notifications are sent to individuals as deadline for re-training approaches."
                  },
                  {
                    "statement-id": "at-4_smt.b",
                    "uuid": "17b0fe00-127f-4d31-874f-8aa19c587501",
                    "description": "Client maintains training certifications for the specified period."
                  }
                ]
              },
              {
                "uuid": "bc519b0b-d468-4f11-acb6-8746e27edc51",
                "control-id": "au-1",
                "description": "au-1 statements",
                "statements": [
                  {
                    "statement-id": "au-1_smt",
                    "uuid": "0fd4ddd2-baec-4130-9e81-4f67703c1b6e",
                    "description": "The Project maintains a record of system activity by application process and by user activity. Audit and accountability policy and procedures are documented within the Project SSP. Security software features are used to automatically generate and store security audit log records for use in monitoring security-related events on all multi-user systems. The Client reviews and updates this policy as necessary and it was last updated in April 2008. Additional information is contained within the None."
                  }
                ]
              },
              {
                "uuid": "29590815-5ac4-4d5f-9581-03f094002428",
                "control-id": "au-8",
                "description": "au-8 statements",
                "statements": [
                  {
                    "statement-id": "au-8_smt",
                    "uuid": "47a5e3ba-e7d1-4197-a042-30a59e5c7ecf",
                    "description": "The Project system clocks are synchronized system-wide and provide time stamps with audit records."
                  }
                ]
              },
              {
                "uuid": "6ce3b431-7dc8-49ac-8bdf-629910d30b20",
                "control-id": "ca-1",
                "description": "ca-1 statements",
                "statements": [
                  {
                    "statement-id": "ca-1_smt",
                    "uuid": "aada5674-bf5b-4253-bb89-5428e13e96c4",
                    "description": "Project follows the None. The Project System Security Policy (SSP) provides guidance on all aspects of security for the protection of Project information technology resources.\n\nProject will periodically review and update the SSP when there is a significant change to the regulatory, operational, or technical environment."
                  }
                ]
              },
              {
                "uuid": "56c18670-25d9-4dc8-a2fa-e6bb74ffd185",
                "control-id": "ca-2",
                "description": "ca-2 statements",
                "statements": [
                  {
                    "statement-id": "ca-2_smt.a",
                    "uuid": "0a86d9da-42a3-48ea-befa-b234238f15e8",
                    "description": "The The Project follows the None. The The Project will conduct annual security assessments to comply with FISMA and NIST regulations. Project will draw on NIST Special Publications 800-53A security controls to complete the assessment. All controls and sub-set security controls will be evaluated and a risk assessment will be conducted. The scope of the assessment includes:\n\n1. Security controls and control enhancements under assessment\n2. Assessment procedures to be used to determine security control effectiveness\n3. Assessment environment, assessment team, and assessment roles and responsibilities"
                  },
                  {
                    "statement-id": "ca-2_smt.c",
                    "uuid": "1fb24eef-64d9-4fcd-88ec-56237ce1cebe",
                    "description": "The Project Authorizing Official or Designated Representative will create a Security Assessment Report (SAR). A full assessment shall be conducted by an independent third party assessor at least every three years."
                  }
                ]
              },
              {
                "uuid": "18bdd877-80ff-4dce-8b20-fbdc8fb9ff94",
                "control-id": "ca-5",
                "description": "ca-5 statements",
                "statements": [
                  {
                    "statement-id": "ca-5_smt",
                    "uuid": "9abf3a42-3fd5-4891-9b89-066e6767b950",
                    "description": "The Project follows the None procedures in managing POA&Ms."
                  }
                ]
              },
              {
                "uuid": "225de446-6e54-4aad-b630-e452a2c62178",
                "control-id": "ca-6",
                "description": "ca-6 statements",
                "statements": [
                  {
                    "statement-id": "ca-6_smt",
                    "uuid": "8c0956a7-25b4-4b1c-a332-542d364260df",
                    "description": "The Project follows the None. The Project system received its first three-year security accreditation on March 3, 2009, and most recently received an ATO on February 5, 2016.\n\nATO re-assessment will be performed every three years or when there is a major change to the application, in which a senior organizational official will sign and approve the security accreditation."
                  }
                ]
              },
              {
                "uuid": "8f611043-c416-4861-bd0f-3a9cab8764b3",
                "control-id": "cm-1",
                "description": "cm-1 statements",
                "statements": [
                  {
                    "statement-id": "cm-1_smt",
                    "uuid": "f4e9d1a0-809d-42e1-ba73-06d773f5643d",
                    "description": "The configuration management policy and procedures are formally documented in the Project Configuration Management Plan (CMP), which provides the roles and responsibilities as it pertains to physical and environmental protection. It defines responsibilities for the implementation and oversight of the guidance contained herein. Client reviews and updates the policy as necessary."
                  }
                ]
              },
              {
                "uuid": "981831d1-0e49-4092-9bcc-6f6eb8ab936d",
                "control-id": "cm-2",
                "description": "cm-2 statements",
                "statements": [
                  {
                    "statement-id": "cm-2_smt",
                    "uuid": "6dedb37e-1791-4410-a0b5-f3371cd8a7a9",
                    "description": "A CM process has been established and documented in the Project CMP. All updates are made in accordance with the procedures outlined in the CMP. The CM process establishes a baseline of hardware, software, firmware and documentation, as well as changes thereto, throughout the development and life cycle of the information system. CM ensures the control of the information system through its life cycle. It assures that additions, deletions, or changes made to the Project system do not unintentionally or unknowingly diminish security. If the change is major, the security of the system must be re-analyzed."
                  }
                ]
              },
              {
                "uuid": "25c80fd2-00d8-4930-9a56-4dd920ed7bfd",
                "control-id": "cm-4",
                "description": "cm-4 statements",
                "statements": [
                  {
                    "statement-id": "cm-4_smt",
                    "uuid": "96ae6792-6588-4989-9463-6d32d0bc1240",
                    "description": "An Information Security Program is in place to ensure all security-centric impacts to the Project are properly analyzed and conducted by personnel with information security responsibilities (i.e., Project SSO, IT Security Officer, etc.). These individuals have the appropriate skills and technical expertise to analyze the changes to the Project and their associated security ramifications. In support of continuous monitoring and to ensure the Project system lifecycle is fully sustained, a risk assessment process, be it formal or informal, is performed when changes are occur. This ensures that The Client understands the security impacts and can determine if additional security controls are required."
                  }
                ]
              },
              {
                "uuid": "2cce7191-59cc-4d74-a2db-28bdd716305b",
                "control-id": "cm-6",
                "description": "cm-6 statements",
                "statements": [
                  {
                    "statement-id": "cm-6_smt.a",
                    "uuid": "aa6365f7-1723-4e34-9278-023fbc55993e",
                    "description": "The Project is configured in compliance with the applicable baseline security standards. The Department and its technical support staff configure the security settings of all IT products to the most restrictive mode consistent with information system operational requirements. Project utilizes the NIST Special Publication 800-70 for guidance on configuration settings (checklists) for information technology products. When security setting checklist are not available from NIST for a particular device, good security engineering practices along with manufacture guidelines is used to develop the security settings. The CM Manager conducts configuration audits to ensure baseline compliance and documentation of hardware/software configurations throughout the system lifecycle."
                  },
                  {
                    "statement-id": "cm-6_smt.b",
                    "uuid": "bb7c1cd9-13e4-457f-8a79-ab75f6ad8d52",
                    "description": "Configuration settings are implemented, monitored, and controlled in accordance with the organizational Configuration Management Plan for the security configuration management processes and tools."
                  },
                  {
                    "statement-id": "cm-6_smt.c",
                    "uuid": "673da9a0-6f74-4446-a329-dc0b95271990",
                    "description": "Currently, deviations do not exist for established configuration settings. In the event this changes, the following notes the process that will take place.\nThe CivicActions CCB, identifies, approves, and documents exceptions to mandatory configuration settings for individual components within its cloud offering only when operationally necessary. All variances identified during the monthly and annual system testing scans that must be accepted for operational purposes are tracked."
                  }
                ]
              },
              {
                "uuid": "426d470e-9d5b-4042-b386-98a3bb8f192c",
                "control-id": "cm-7",
                "description": "cm-7 statements",
                "statements": [
                  {
                    "statement-id": "cm-7_smt.a",
                    "uuid": "a55737b1-b61f-43bb-b69d-e046a429632a",
                    "description": "Services are limited to provide only essential capabilities."
                  },
                  {
                    "statement-id": "cm-7_smt.b",
                    "uuid": "ba19311e-908f-41b0-83ec-4c81224cd565",
                    "description": "The Project maintains strict default deny policy with access controls at the firewall, and on individual systems. Inbound access across the system boundary is only allowed on ports 22 (ssh), 80 (http) and 443 (https), with an additional port, 25 (smtp) open on the mail server."
                  }
                ]
              },
              {
                "uuid": "e0c410df-4ee8-4201-ab35-6f583bc0704d",
                "control-id": "cp-1",
                "description": "cp-1 statements",
                "statements": [
                  {
                    "statement-id": "cp-1_smt",
                    "uuid": "dfabdcb2-d91d-4ffc-b56b-a7278470138c",
                    "description": "This is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nThe Project and has developed a contingency planning policy consistent with NIST 800-34. Contingency planning procedures are formally documented within the Project Contingency Plan, which provides the roles and responsibilities as it pertains to contingency planning. The Project reviews and updates the policy as necessary and the policy was last updated in July 2012."
                  }
                ]
              },
              {
                "uuid": "71e9be6f-1ec3-44d7-91ae-2aa882a2a227",
                "control-id": "cp-2",
                "description": "cp-2 statements",
                "statements": [
                  {
                    "statement-id": "cp-2_smt.b",
                    "uuid": "effb18c5-3f45-44c4-b7d1-97ccc3229693",
                    "description": "The Project Information System Contingency Plan (ISCP) has been distributed to all members who have roles in Contingency Planning and Incident Response Team. Direction by the System Owner will update who is required to receive a copy of the contingency plan. The ISCP can be found in the Project GitHub wiki at <https://civicactions-handbook.readthedocs.io/en/latest/09-security/contingency-plan>."
                  }
                ]
              },
              {
                "uuid": "93082756-4d90-4856-a198-d03e3a71300e",
                "control-id": "ia-1",
                "description": "ia-1 statements",
                "statements": [
                  {
                    "statement-id": "ia-1_smt",
                    "uuid": "1f9e20da-e38a-4e93-8de1-0b150f13d4f7",
                    "description": "The Project system owners/managers manage user identifiers by: (i) uniquely identifying each user; (ii) verifying the identity of each user; (iii) receiving authorization to issue a user identifier from an appropriate official; (iv) ensuring that the user identifier is issued to the intended party; (v) disabling user identifier after a reasonable period of inactivity as documented in its security procedures; and (vi) archiving user identifiers. Project reviews and updates this policy as necessary."
                  }
                ]
              },
              {
                "uuid": "edf0bd4e-9092-4276-9db0-709414da5e75",
                "control-id": "ia-2.1",
                "description": "ia-2.1 statements",
                "statements": [
                  {
                    "statement-id": "ia-2.1_smt",
                    "uuid": "89f82af9-fccf-44e3-8682-462b24e0c18b",
                    "description": "The Project employs multi-factor authentication for privileged users."
                  }
                ]
              },
              {
                "uuid": "09ef5001-3772-443e-9b47-94e8ec486028",
                "control-id": "ia-2.12",
                "description": "ia-2.12 statements",
                "statements": [
                  {
                    "statement-id": "ia-2.12_smt",
                    "uuid": "77b60d50-1dad-4d0c-a239-3b3a5df40cdf",
                    "description": "The Project system allows users to access the system using Common Access Cards (CAC)."
                  }
                ]
              },
              {
                "uuid": "eb2b9aa7-9af2-4e0b-aa8c-261a07775df7",
                "control-id": "ia-5",
                "description": "ia-5 statements",
                "statements": [
                  {
                    "statement-id": "ia-5_smt.a",
                    "uuid": "a819cc66-8281-45a5-a882-ec786a66a2ae",
                    "description": "Authentication for Project internal personnel are created during the personnel assignment process where requests are made to the Project admin group for proper access levels. The Project admin group verifies the identity of the user. The website performs further verification by sending an email to the user's mailbox containing a single-use activation link which must be used to log in to the account for the first time and to create a password."
                  },
                  {
                    "statement-id": "ia-5_smt.b",
                    "uuid": "d377e9b2-5646-4d3e-b666-c3e8e61d2695",
                    "description": "Project admins in collaboration with CivicActions Operations are responsible for provisioning and de-provisioning end user accounts in compliance with the authentication requirements described herein."
                  },
                  {
                    "statement-id": "ia-5_smt.c",
                    "uuid": "267c6ee3-6d71-4f77-abf9-d30fb713c0a5",
                    "description": "When entering a user account password upon initial login, all users must comply with the following password policies, which are enforced by the website's software configuration:\n\n- Password must be at least 14 characters in length.\n- Password must contain at least one digit.\n- Password must contain at least one special character (not whitespace or an alphanumeric).\n- Password must contain at least one uppercase character.\n- Password must contain at least one lowercase character."
                  },
                  {
                    "statement-id": "ia-5_smt.d",
                    "uuid": "d0f9a3a7-ac48-47d3-a436-aa2a322b6a90",
                    "description": "Project is responsible for provisioning and de-provisioning end user accounts, which must comply with the strict password policies that are enforced by the website's software configuration, as described in IA-5(d).\n\nIn accordance with Project site configuration, the following administrative procedures exist for initial authenticator distribution, for lost/compromised/damaged authenticators, and for revoking authenticators.\n\n- Initial authenticator distribution: Users receive a one-time login link\n  by email upon creating of their user account. They use that link to log\n  in and then must enter a password themselves which complies with the\n  password complexity requirements described in IA-4(b).\n\n- Lost/compromised/damaged authenticators: Users who have forgotten their\n  password may request a new password by submitting their username or\n  email address. The website responds by emailing a one-time login link\n  to the user's email address. After using the link to log in, the user\n  is required to enter a new password.\n\n- Revoking authenticators: Users who have not changed their password in\n  the last 90 days are automatically blocked. Administrators may block\n  any user account if they believe there is a reason to do so."
                  },
                  {
                    "statement-id": "ia-5_smt.f",
                    "uuid": "20619da5-97e3-4ef4-bb4e-ae38d17867e1",
                    "description": "Project authenticators follow these password lifetime restrictions:\n\n- Maximum password age = 90\n- Minimum password age = 1\n- Password reuse restriction = 10"
                  },
                  {
                    "statement-id": "ia-5_smt.g",
                    "uuid": "8311849a-20ec-4532-b3dc-1ff79802d484",
                    "description": "Project enforces password lifetime restrictions. The password lifetime settings for internal accounts is as follows:\n\n- Minimum restriction of zero (1) days and\n- Maximum restriction of ninety (90) days before a password change is required."
                  }
                ]
              },
              {
                "uuid": "f81ab4dd-4d9e-4821-b214-228a4c8835e6",
                "control-id": "ia-5.1",
                "description": "ia-5.1 statements",
                "statements": [
                  {
                    "statement-id": "ia-5.1_smt",
                    "uuid": "f309ec41-aa50-4165-ac55-bf395ef37e9e",
                    "description": "Project is responsible for provisioning and de-provisioning end user accounts, which must comply with the strict password policies that are enforced by the website's software configuration, as described in IA-5."
                  }
                ]
              },
              {
                "uuid": "28d7224b-ed91-4e95-941a-1431a0cd4056",
                "control-id": "ia-5.11",
                "description": "ia-5.11 statements",
                "statements": [
                  {
                    "statement-id": "ia-5.11_smt",
                    "uuid": "9ed77583-a697-4341-98fc-4011b8907070",
                    "description": "Project does not support physical hardware token-based authentication. Therefore this control is Not Applicable."
                  }
                ]
              },
              {
                "uuid": "913373b2-d8bd-4212-a348-d188b174018b",
                "control-id": "ia-8.1",
                "description": "ia-8.1 statements",
                "statements": [
                  {
                    "statement-id": "ia-8.1_smt",
                    "uuid": "97b47a53-36e0-4468-b4d8-b6123cc19429",
                    "description": "Project allows the use of customer agency supplied Common Access Cards (CAC)."
                  }
                ]
              },
              {
                "uuid": "8d8b6cae-e072-4d10-a208-a41b7ef0be96",
                "control-id": "ia-8.2",
                "description": "ia-8.2 statements",
                "statements": [
                  {
                    "statement-id": "ia-8.2_smt",
                    "uuid": "b1b4e792-fa11-4d4b-bc59-d2871ae78ea3",
                    "description": "Project does not utilize FICAM approved credentials."
                  }
                ]
              },
              {
                "uuid": "c36f6a3c-e35b-495b-9487-2decf545d4d1",
                "control-id": "ia-8.3",
                "description": "ia-8.3 statements",
                "statements": [
                  {
                    "statement-id": "ia-8.3_smt",
                    "uuid": "cbcd0cae-2869-4671-b53a-c0008ba778cb",
                    "description": "Project does not utilize FICAM approved products."
                  }
                ]
              },
              {
                "uuid": "fbf80161-2886-425a-b46f-af8b11eb8220",
                "control-id": "ia-8.4",
                "description": "ia-8.4 statements",
                "statements": [
                  {
                    "statement-id": "ia-8.4_smt",
                    "uuid": "89570aae-88c7-4d03-80b5-c1d6749c8e80",
                    "description": "CivicActions does not utilize FICAM approved products or profiles."
                  }
                ]
              },
              {
                "uuid": "65af7476-f361-4507-b0a3-253414bafb63",
                "control-id": "ir-1",
                "description": "ir-1 statements",
                "statements": [
                  {
                    "statement-id": "ir-1_smt",
                    "uuid": "8c55f43a-d49a-4fea-83f4-581dd0701b30",
                    "description": "This is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nThe Project maintains an Incident Response Plan (IRP), consistent with NIST 800-61, which addresses purpose, scope, roles, and responsibilities. The incident response procedures address any activity or occurrence that compromises the integrity of a system, denies access to or use of IT resources, and compromises the sensitivity of the information stored in, processed by or transmitted by a system.\n\nAdditionally, the IRP includes procedures to respond to waste, fraud, misuse, or abuse of any departmental IT system, damage or loss of software or data contained in any system, Use of unlicensed (pirated) software products, discovery of hardware or software vulnerabilities\n\nThe Project Incident Response Plan can be found in the CivicActions GitHub repository at <https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>"
                  }
                ]
              },
              {
                "uuid": "4048d9f7-9d59-40f9-a618-4da58ddb1c8b",
                "control-id": "ir-2",
                "description": "ir-2 statements",
                "statements": [
                  {
                    "statement-id": "ir-2_smt",
                    "uuid": "bb7f9e8d-3bae-4bb3-9109-69c2e54b43a2",
                    "description": "CivicActions Operations and users of the Project system with incident response responsibilities are required to participate in incident response training once the role is assumed within 10 days, as required by Project changes, and annually. The Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) is the basis for the training and the incident response workflow created by the Security team. Upon a review of past incidents, the training is updated to ensure processes and workflows are updated."
                  }
                ]
              },
              {
                "uuid": "1b21e883-96fe-457f-a6fc-4c8af7cf5ce8",
                "control-id": "ir-4",
                "description": "ir-4 statements",
                "statements": [
                  {
                    "statement-id": "ir-4_smt",
                    "uuid": "ffdb6ac3-688f-4915-bdbc-548c07dc6a99",
                    "description": "The Client Computer Security Officer (CSO) handles all incidents for the The Project.\n\nThe The Client utilizes proven incident handling methodologies for security incidents that includes preparation, detection and analysis, containment, eradication, and recovery. The Client maintains a list of lessons learned from ongoing incident handling activities and uses those lessons to update the incident response procedures accordingly.\n\nPreparation activities includes all CivicActions and Project internal users are trained if their role includes incident response. Detection monitoring tools providing notification to incident response personnel for analysis and action. Containment, eradication and recovery activities include AWS and LAMP-stack inherited fixes and Project system administrators adjusting IP port blocking security groups and SELinux policies."
                  }
                ]
              },
              {
                "uuid": "346fcafa-76c8-4e44-8117-a98f9f27f891",
                "control-id": "ir-5",
                "description": "ir-5 statements",
                "statements": [
                  {
                    "statement-id": "ir-5_smt",
                    "uuid": "382ccb04-14be-4b66-8c70-9d87cda519a8",
                    "description": "The Project utilizes network and host-based intrusion detection systems, monitoring the system and application logs for anomalous events. Incidents are tracked using the same ticketing system that is used to track all system-related changes and events."
                  }
                ]
              },
              {
                "uuid": "40c4d35e-2445-4fc0-9ddf-e463a0245c9a",
                "control-id": "ir-6",
                "description": "ir-6 statements",
                "statements": [
                  {
                    "statement-id": "ir-6_smt",
                    "uuid": "7c0ee515-fb61-4bbb-8049-df8d17ad9786",
                    "description": "If an incident involves suspicious activity, CivicActions Operations will contact the Project System Owner who may then contact the Project CSO.\n\nThe CivicActions Computer Security Officer (CSO) handles all incidents for the Project. The CSO is prepared to report all incidents to the The Client."
                  }
                ]
              },
              {
                "uuid": "758a42ac-8bfe-4030-8e40-e57fc1f39995",
                "control-id": "ir-8",
                "description": "ir-8 statements",
                "statements": [
                  {
                    "statement-id": "ir-8_smt",
                    "uuid": "e4cbcaf8-7a52-4453-993e-a97a1983cfca",
                    "description": "The Project Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) includes a comprehensive incident response program, which details the implementation of procedures and tools required for incident handling. The incident response program details the roles and responsibilities of Project/ CivicActions IR Team. The IR Team includes members from CivicActions Security and Operations teams. Incident response plays a pivotal role in monitoring, detecting and handling security incidents of the entire information system. The IRP details categorization of incidents in accordance with NIST 800-61 and accordingly documents and reports incidents. The IRP is reviewed annually and updated as needed by ISSO, with the assistance of the Incident Response Team."
                  }
                ]
              },
              {
                "uuid": "8982746d-f156-462d-beef-94df1f04c5f7",
                "control-id": "ma-1",
                "description": "ma-1 statements",
                "statements": [
                  {
                    "statement-id": "ma-1_smt",
                    "uuid": "6c326a3d-eb5b-445e-87fa-2c0132dce756",
                    "description": "System maintenance policy and procedures are formally documented in the Project SSP, which provides the roles and responsibilities as it pertains to software and systems maintenance and updates. The The Project ensures that maintenance controls are developed, disseminated, reviewed, and updated as necessary.\n\nPhysical and environmental protection is fully inherited from the AWS FedRAMP certified us-east cloud.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "28d257e2-f28a-46ee-980c-d558d0b355b2",
                "control-id": "ma-2",
                "description": "ma-2 statements",
                "statements": [
                  {
                    "statement-id": "ma-2_smt",
                    "uuid": "71bb36fa-dfd7-4920-aa95-8642ff61fb1f",
                    "description": "The Project schedules, performs, and documents regular maintenance on the software components of all systems, including but not limited to:\n\n- Hourly automated snapshot backups\n- Daily disaster recovery remote backups\n- Daily Intrusion Detection (OSSEC) / Data Integrity Assurance (AIDE)\n- As needed help desk support\n- Twice-monthly OS updates/patches"
                  }
                ]
              },
              {
                "uuid": "68a7e724-ae5f-4df3-bc84-eb62ac41b579",
                "control-id": "ma-5",
                "description": "ma-5 statements",
                "statements": [
                  {
                    "statement-id": "ma-5_smt",
                    "uuid": "4d2a4a27-025b-44eb-99ba-fe45ba8e142b",
                    "description": "Client maintains a list of authorized contract (CivicActions) personnel who perform maintenance and repair activities on the Project Project system components, and only these authorized personnel may perform the maintenance. All maintenance personnel have the required personnel security elements in place."
                  }
                ]
              },
              {
                "uuid": "d82ff1dd-5e50-4a05-96c3-5d82b47d45c2",
                "control-id": "mp-1",
                "description": "mp-1 statements",
                "statements": [
                  {
                    "statement-id": "mp-1_smt",
                    "uuid": "36410e5d-c077-4fbd-8f3d-6fc92d599359",
                    "description": "This is Agency common control. More data about implementation can be obtained from the Agency common control catalog. Media protection policy and procedures are fully inherited from AWS Cloud."
                  }
                ]
              },
              {
                "uuid": "7623f203-f027-436a-a9f0-aea906b5eee3",
                "control-id": "pl-1",
                "description": "pl-1 statements",
                "statements": [
                  {
                    "statement-id": "pl-1_smt",
                    "uuid": "a9b32b68-6694-44b3-a188-6bcb1f071829",
                    "description": "This is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nThe Project developed its security policy planning and procedures based on None, guidance from NIST, the Office of Management and Budget and industry best practices. Security policies and procedures are formally documented within the Project SSP, which provides the roles and responsibilities as it pertains to security planning. It provides guidance on all aspects of security for the protection of Project information technology resources. It defines responsibilities for the implementation and oversight of the guidance contained herein. The plan was last updated in December, 2015."
                  }
                ]
              },
              {
                "uuid": "6462daa5-d8f2-4e76-aaec-f64e0a966766",
                "control-id": "pl-2",
                "description": "pl-2 statements",
                "statements": [
                  {
                    "statement-id": "pl-2_smt",
                    "uuid": "d5aee31a-29db-4dd2-94f1-9022ec98e6c9",
                    "description": "The System Security Plan (SSP) was developed and implemented for Project system in accordance with None, NIST SP 800-18 and NIST SP 800-37. The SSP includes a description of the management, operational, and technical controls in place or planned for the application. The SSP is included as a key document in an application’s C&A package and is reviewed and approved by designated officials. The SSP identifies the system owner and responsible parties for managing system access and the overall security of the system. The Chief Information Security Officer reviews and approves the SSP. The SSP will be reviewed at least annually and updated to account for any changes to the Project system and to address any changes in security controls."
                  }
                ]
              },
              {
                "uuid": "3113e065-f60b-4a06-899a-4a615bae5d77",
                "control-id": "pl-4",
                "description": "pl-4 statements",
                "statements": [
                  {
                    "statement-id": "pl-4_smt.a",
                    "uuid": "9aae85e6-c4dc-4ff3-a39d-103c7c87779d",
                    "description": "Project has created and made readily available to individuals requiring access to the information system the rules that describes their responsibilities and expected behavior with regard to information and information system usage. These rules are captured in ‘Appendix J2 - System Rules of Behavior - General User’ (ProjectSystemRoB2019-template.docx).\n\nProject has reviewed and accepted as a superset alternative the CivicActions Acceptable Use Policy."
                  },
                  {
                    "statement-id": "pl-4_smt.b",
                    "uuid": "ed362101-4a49-4f93-9b02-6cb20a4be043",
                    "description": "The Project System Owner receives a signed acknowledgment from such individuals that are not CivicActions employees, indicating that they have read, understand, and agree to abide by the rules of behavior, before authorizing access to information and the information system."
                  },
                  {
                    "statement-id": "pl-4_smt.c",
                    "uuid": "a2999659-cb89-4718-b908-a63fed9d9b93",
                    "description": "Project reviews the Rules of Behavior at least annually and updates it as required."
                  },
                  {
                    "statement-id": "pl-4_smt.d",
                    "uuid": "20742a96-3fad-4bae-9c95-f0b1c4fcf6d9",
                    "description": "Project requires individuals who have signed a previous version of the rules of behavior to read and re-sign when the Rules of Behavior are revised/updated."
                  }
                ]
              },
              {
                "uuid": "3d50c834-756b-4a68-9aec-f3f0c285a8a3",
                "control-id": "ps-1",
                "description": "ps-1 statements",
                "statements": [
                  {
                    "statement-id": "ps-1_smt",
                    "uuid": "ff914c16-6596-4d84-bdde-aecf45b24f0f",
                    "description": "The Project documents the security policy and procedures in addressing position categorization, personnel screening, personnel termination, personnel transfer, and access agreements within the Project SSP. Project adopts the Client personnel security standards and determines position risks levels based on public trust responsibilities.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "de7da427-c5fa-4d3a-a33d-ac9d0a055d42",
                "control-id": "ps-2",
                "description": "ps-2 statements",
                "statements": [
                  {
                    "statement-id": "ps-2_smt",
                    "uuid": "2f5b35a4-17d4-4538-8555-dd4cecc26002",
                    "description": "Project position sensitivity levels are assigned by the The Client. Each position designation is documented on the Standard Position Description (SPD) and assigned a risk level (or sensitivity level) commensurate with the sensitivity of the information, the risk to that information and the system maintaining that information. The levels of risk still need to be designated by Client for employee and contractor positions but since Project system does not have any sensitive data, a low risk scenario can be assumed.\n\n- Employee risk levels and background investigations are: Low Risk= NACI, Moderate Risk= LBI, High Risk= BI.\n- Contractor risk levels and background investigations are: Low Risk= NACI, Moderate Risk= NACC, High Risk= BI.\n\nIn order to ensure every employee is assigned to a position, which has been reviewed for sensitivity by the NCC, the SPD is a required data attribute of an employee’s HR record. Position risks designations are reviewed and revised when NCC or OPM publish changes to sensitivity levels.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog"
                  }
                ]
              },
              {
                "uuid": "78725cd8-5c51-44db-9891-12ebe09afe89",
                "control-id": "ps-3",
                "description": "ps-3 statements",
                "statements": [
                  {
                    "statement-id": "ps-3_smt",
                    "uuid": "05c9c0d1-3f5e-48a3-915a-92ae1cdf6054",
                    "description": "Minimum background investigations are conducted, since all data is non-sensitive, for individuals requiring access to Project information and information systems. The type of background investigation conducted for an individual is determined by the individual’s position risk categorization noted in control PS-2. Client conducts periodic reinvestigations in accordance with OPM and NIST guidelines.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "ec00472a-41cc-4a36-a2a0-3e3c99ec3920",
                "control-id": "ps-4",
                "description": "ps-4 statements",
                "statements": [
                  {
                    "statement-id": "ps-4_smt",
                    "uuid": "95d556c9-8092-4b94-ac85-62384a043c0e",
                    "description": "The Client HR policy states that managers or designated officials are responsible for recovering and properly securing employee badges and returning it to the local physical security office. The Client executes termination procedures that remove personnel access privileges, computer accounts. When an employee is terminated, the employee’s manager or designated official completes a form requesting termination of access for the user. Local management and the security manager coordinate disabling or removing Project privileged access with the system administrator. The employee’s manager or designated official is responsible for recovering and properly securing his/her ID badge and returning it to the local physical security office. The employee’s manager or designated official ensures that any information on the system that the employee was responsible for will be available to the appropriate personnel.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "060a5789-aa39-4598-ba12-e57e23e17995",
                "control-id": "ps-5",
                "description": "ps-5 statements",
                "statements": [
                  {
                    "statement-id": "ps-5_smt",
                    "uuid": "6328f010-f5cb-4634-83d5-a12c2b6ff9c7",
                    "description": "When an employee is reassigned or transferred, the employee’s manager or designated official is required to request transfer of access (as appropriate) for the user.\n\nIn accordance with the The Client HR policy, the employee’s manager or designated official is responsible for recovering and properly securing his/her ID badge and returning it to the local physical security office. The manager provides prompt notification to the Project system/security administrator when an employee changes assignments and/or location. This includes taking prompt and appropriate action to change employee access profile and/or remove employee from the system; and ensure that users’ system access is cancelled when the need no longer exists.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "dadac4de-973b-463d-aab8-b7d29af3b947",
                "control-id": "ps-6",
                "description": "ps-6 statements",
                "statements": [
                  {
                    "statement-id": "ps-6_smt.a",
                    "uuid": "d6df9326-42be-4787-95a0-78d525996f04",
                    "description": "All users of the Project system must read and accept access agreements upon every login."
                  },
                  {
                    "statement-id": "ps-6_smt.b",
                    "uuid": "9ab489ed-3423-49fa-999f-9ebb062bb41e",
                    "description": "The Access Agreements are reviewed at least annually or when a significant change occurs."
                  },
                  {
                    "statement-id": "ps-6_smt.c",
                    "uuid": "1edd0790-6202-4e9f-9990-2ca0fa10032c",
                    "description": "All individuals requiring access to the Project system are required to sign the Access Agreements before login is granted. When the Access Agreements are updated, the individual will be required to sign the new copy before regaining access."
                  }
                ]
              },
              {
                "uuid": "5230dc86-769c-423f-adb0-9dfce7801e54",
                "control-id": "ps-7",
                "description": "ps-7 statements",
                "statements": [
                  {
                    "statement-id": "ps-7_smt.a",
                    "uuid": "04f77377-777c-41a7-9565-8f8018c8fdd6",
                    "description": "Personnel security requirements including security roles and responsibilities that apply to primary contracting organizations flow down to their subcontractors."
                  },
                  {
                    "statement-id": "ps-7_smt.b",
                    "uuid": "b5e51627-8f2a-4004-92af-cfbc013677b6",
                    "description": "Personnel security policies and procedures that apply to primary contracting organizations flow down to their subcontractors."
                  },
                  {
                    "statement-id": "ps-7_smt.c",
                    "uuid": "5091ba84-9d20-4f11-9320-c28d0212ad74",
                    "description": "All personnel security requirements are documented in PS-1 and other related Personnel Security controls."
                  },
                  {
                    "statement-id": "ps-7_smt.d",
                    "uuid": "9171c1da-124f-47bf-83bc-59861861d351",
                    "description": "For personnel transfers and terminations of third-party personnel, the procedures defined in employee termination (PS-4) and employee transfer (PS-5) flow down to subcontractors."
                  },
                  {
                    "statement-id": "ps-7_smt.e",
                    "uuid": "0a69cd89-3dc4-498b-80a8-5f73a7e78031",
                    "description": "Compliance measures for assessing third-party personnel and/or contractors are determined on a case-by-case basis. Third-party personnel are monitored to ensure compliance with personnel security requirements."
                  }
                ]
              },
              {
                "uuid": "7504cfd0-4945-4e78-bff5-33196775ce6b",
                "control-id": "ps-8",
                "description": "ps-8 statements",
                "statements": [
                  {
                    "statement-id": "ps-8_smt",
                    "uuid": "87d9ac2f-9ec8-43fe-9e3d-3aa93288c337",
                    "description": "The disciplinary sanctions for personnel failing to comply with establish IT security policies and procedures are included in The Client HR policy. If an employee violates the Client information security policies and procedures, the employee may be subject to disciplinary action at the discretion of management. Actions may range from verbal or written warning, removal of system access for a specific period of time, reassignment to other duties, or termination, depending on the severity of the violation. Disciplinary sanctions are reported to the OCIO."
                  }
                ]
              },
              {
                "uuid": "822105ca-8735-4192-9916-570c732d1bef",
                "control-id": "ra-1",
                "description": "ra-1 statements",
                "statements": [
                  {
                    "statement-id": "ra-1_smt",
                    "uuid": "fb514a30-4808-4012-8492-f7bc93000a79",
                    "description": "The Client follows the risk assessment policy and procedures formally documented within None. Furthermore, a Risk Assessment Plan was originally initiated to determine the extent of the potential threat and the risk associated with Project throughout its System Development Life Cycle (SDLC). The Project Risk Assessment defines the methodology approach to determine the likelihood risks, and identify potential mitigation options to reduce risks to the Project system.\n\nThe Project Risk Assessment will be conducted in accordance with the Department’s risk assessment policy and procedures. By doing so, the responsible parties associated with the Project will be able to determine the risk, likelihood and impact that could result from exploiting vulnerabilities within the system.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "3d8b0c97-2837-45b2-b8d8-76860f92500a",
                "control-id": "ra-2",
                "description": "ra-2 statements",
                "statements": [
                  {
                    "statement-id": "ra-2_smt.a",
                    "uuid": "a7c9400c-37cf-4026-bbe6-38506b4bccac",
                    "description": "In accordance with FIPS 199 requirement and guidelines provided in NIST SP800-60 Rev.1, the organization categorized the system as a Low system: Confidentiality (Low), Integrity (Low), Availability (Low)."
                  },
                  {
                    "statement-id": "ra-2_smt.b",
                    "uuid": "2781bf6d-01b5-486a-8de4-c78304ab54ba",
                    "description": "The security categorization was determined by evaluating the type of information that is stored, processed, and/or transmitted by the application and the potential impact levels associated with the confidentiality, integrity, and availability of that information. The application’s security categorization has been documented in this SSP."
                  },
                  {
                    "statement-id": "ra-2_smt.c",
                    "uuid": "b744a09e-a16f-4cef-b821-7c8cc233e658",
                    "description": "The security categorizations have been reviewed by the designated application POCs, were approved during the C&A effort. The formal security categorization document is available upon request. The system inventory for the Project Project is revalidated semiannually."
                  }
                ]
              },
              {
                "uuid": "bcff75c3-53a6-49b1-a9b0-36edc7ac0d41",
                "control-id": "ra-3",
                "description": "ra-3 statements",
                "statements": [
                  {
                    "statement-id": "ra-3_smt.a",
                    "uuid": "790060b5-9ce2-492f-b0b7-a040e2919406",
                    "description": "CivicActions/Project will perform risk assessments for the Project system based on SP 800-30 Rev. 1 Guide for Conducting Risk Assessments at least annually and as part of the change management activities for the Project system that warrant a new or updated risk assessment."
                  },
                  {
                    "statement-id": "ra-3_smt.b",
                    "uuid": "13aeba3a-edad-492a-a6ae-fdc5b0aa66f0",
                    "description": "The results of risk assessments will be compiled into a risk assessment report to be reviewed by CivicActions Security and relevant personnel, and also added to the GitLab system for the Project system."
                  },
                  {
                    "statement-id": "ra-3_smt.c",
                    "uuid": "4a20efd1-aa3e-4d39-adf6-94a5b6bdf1cc",
                    "description": "CivicActions/Project reviews risk assessment\nresults at least annually."
                  },
                  {
                    "statement-id": "ra-3_smt.d",
                    "uuid": "92fbc490-2c80-4dc0-ad04-9919da5a4817",
                    "description": "The Risk Assessment report will be disseminated to the appropriate\npersonnel through the Project Manager and CivicActions\nSecurity."
                  },
                  {
                    "statement-id": "ra-3_smt.e",
                    "uuid": "81a8d6c0-eb23-4e0d-8e42-9de9fb6ff98a",
                    "description": "Risk assessments are conducted annually or whenever there are significant changes to the information system or environment of operation (including the identification of new threats and vulnerabilities), or other conditions that may impact the security state of the system, as defined in NIST Special Publication 800-37 Revision 1.\nA significant change includes:\n\n- Changing authentication or access control implementations;\n- Changing storage implementations;\n- Changing a COTS product to another product;\n- Changing the backup mechanisms and process; and,\n- Adding new interconnections to an outside service provide."
                  }
                ]
              },
              {
                "uuid": "fa3a5626-8239-446d-ae4f-bf9250571510",
                "control-id": "ra-5",
                "description": "ra-5 statements",
                "statements": [
                  {
                    "statement-id": "ra-5_smt",
                    "uuid": "1a971d86-6f50-4637-ab99-e6dc35913805",
                    "description": "The Project uses vulnerability scanning software to document and determine risks to the system. These scans are run monthly and the results of these scans are being used to inform changes to the system and verify that security controls are working correctly. These scans are used to document the current state of the system, and to analyze security trends as changes are made over time."
                  }
                ]
              },
              {
                "uuid": "a3f68d36-3a5d-4e77-bb45-0c7fe4786177",
                "control-id": "sa-1",
                "description": "sa-1 statements",
                "statements": [
                  {
                    "statement-id": "sa-1_smt",
                    "uuid": "427b344d-8c94-4a1e-a3bd-24c93e442be1",
                    "description": "The Project complies with the None. The Project will identify new threats/vulnerabilities and technologies that may require updating of solicitation documents.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "626bf914-59b2-49dd-a353-3612b6cb8b8f",
                "control-id": "sa-2",
                "description": "sa-2 statements",
                "statements": [
                  {
                    "statement-id": "sa-2_smt",
                    "uuid": "6a9129ca-1212-4807-bbc7-7ae1f5aeebd0",
                    "description": "The Project System Owner is responsible for leading the annual budgeting process and for tracking organizational spending. The System Owner coordinates with the CivicActions Project Manager and CivicActions Security on at least monthly basis to track security priorities and spending patterns and determine financial requirements. The System Owner also coordinates the approval process for interim increases to the security budget, if required. This data is used to support the development of the annual budget.\n\nSecurity costs are included in Exhibit 53 in the Department's on-line electronic Capital Planning and Investment Control system (eCPIC) in order to provide adequate business case information for budget purposes. Security costs are represented across the life cycle in the business case (Exhibit 300) for major investments and (Exhibit 53) for non-major projects - Project is a non-major project. Security costs are summarized and listed as a line item on the Exhibit 53 in the budget submitted to Treasury.\n\nCosts for providing security at the infrastructure level are contained in the business cases for infrastructure supporting computing platforms, desktop processing, the network environment, and web capability. Since the Exhibit 53 includes projections for multiple fiscal years, its intention is to identify and anticipate security resources required."
                  }
                ]
              },
              {
                "uuid": "29ff257c-7ee1-4bcc-abd8-a1b6c69b41e1",
                "control-id": "sa-3",
                "description": "sa-3 statements",
                "statements": [
                  {
                    "statement-id": "sa-3_smt",
                    "uuid": "ba765da0-92ef-4dc1-920a-c1fe8d006858",
                    "description": "The Project draws from the None, NIST SP 800-64, and Agile software development methodology to ensure security requirements are incorporated during each phase of the life cycle. This helps to ensure the development of secure systems and effective risk management."
                  }
                ]
              },
              {
                "uuid": "2f341239-b546-4302-acb4-ce6f7136e5be",
                "control-id": "sa-4",
                "description": "sa-4 statements",
                "statements": [
                  {
                    "statement-id": "sa-4_smt",
                    "uuid": "d9a5c223-e4ac-4f2d-bed3-d9b2801d40ab",
                    "description": "The Project follows the guidelines and procedures within the overarching None. The requirements in the information system acquisition contract permit updating security controls as new threat/vulnerabilities are identified and new technologies are implemented.\n\nThe Project System and Services Acquisition Policy contains the process for determining acceptance criteria for all Project system software and services.\n\nThe Project organization reviews and approves all acquisition contracts in accordance with applicable federal laws, Executive Orders, directives, policies, regulations, standards, guidelines, and organizational mission/business needs."
                  }
                ]
              },
              {
                "uuid": "309871e6-77c7-44be-9535-2dac3d6780c6",
                "control-id": "sa-4.10",
                "description": "sa-4.10 statements",
                "statements": [
                  {
                    "statement-id": "sa-4.10_smt",
                    "uuid": "ab56ace1-1d9f-4034-a787-20beaa5eae5a",
                    "description": "CivicActions/Project and AWS describes this control as “not applicable”, as PIV credentials are not applicable to the Project system. Access and Authentication requirements for the Project system for internal CivicActions and customer are implemented under access management and enforcement (AC-2 and AC-3) and identification and authentication for all users (IA-2 and IA-8).\n\nIt is the responsibility of CivicActions for implementation of PIV capability for authentication as required."
                  }
                ]
              },
              {
                "uuid": "7f1466f4-bf71-49fd-95ac-0d224b05bf09",
                "control-id": "sa-5",
                "description": "sa-5 statements",
                "statements": [
                  {
                    "statement-id": "sa-5_smt",
                    "uuid": "ab3ee77a-c71b-4953-8b1b-2d40fd450788",
                    "description": "Client maintains adequate documentation for the Project system. The Project system documentation is protected as required and made available to authorized personnel. Procedures for protecting system documentation include management in the private CivicActions Git repository and the publicly available documentation trees for Free and Open Source Software (FOSS). The documentation maintained for the Project system includes:\n\n- System Security Plan (SSP) – this document\n- Configuration documentation\n- Incident Response and Contingency Plans\n- Rules of Behavior (Acceptable Use Policy)\n- FOSS Reference Manuals (Drupal, GNU/Linux, Apache, MySQL, PHP, Postfix,\n  etc.)"
                  }
                ]
              },
              {
                "uuid": "39a55239-b5d2-48d8-98d3-c78ba46a7815",
                "control-id": "sa-9",
                "description": "sa-9 statements",
                "statements": [
                  {
                    "statement-id": "sa-9_smt",
                    "uuid": "dae39d8c-3f99-4271-bd60-20c0dd41f112",
                    "description": "Project does not have any dedicated interconnections between information system components within the authorization boundary and external third-party vendor information systems for the purposes of storing, processing, or transmitting federal agency data.\n\nProject is hosted on the AWS Cloud platform, which was approved under the FedRAMP Provisional ATO granted to the AWS Cloud dated 1 May 2013."
                  }
                ]
              },
              {
                "uuid": "1bf84f92-4c6a-4ef6-8919-7dfe0eb5aaf7",
                "control-id": "sc-1",
                "description": "sc-1 statements",
                "statements": [
                  {
                    "statement-id": "sc-1_smt",
                    "uuid": "bb043fbd-d95a-48fd-bd61-6b932b951fc0",
                    "description": "System and communications protection policy and procedures are formally documented in the None and the Project SSP. The Department reviews and updates the policy as necessary and has been continually updated since April 2008.\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "4f60cb47-81da-47bd-81f0-39f41f9572a8",
                "control-id": "sc-5",
                "description": "sc-5 statements",
                "statements": [
                  {
                    "statement-id": "sc-5_smt",
                    "uuid": "639ebf9f-2234-48fc-b137-fe7e49b2dd79",
                    "description": "The Project system is configured to reduce vulnerabilities in its operating system and applications to protect against Denial of Service (DoS) attacks.\nThe Project support staff ensures the system is protected against or limits the effect of DoS attacks as specified in the None."
                  }
                ]
              },
              {
                "uuid": "af9a7420-df2d-472b-ae32-ee1505428f1b",
                "control-id": "sc-7",
                "description": "sc-7 statements",
                "statements": [
                  {
                    "statement-id": "sc-7_smt",
                    "uuid": "d6f0055c-9be7-48bc-b503-9a44fd8dc0b6",
                    "description": "The Project system has monitored and controlled communications at the external boundary of the information system and at key internal boundaries within the system, where appropriate. The Project allocates publicly accessible information system components (e.g., public web servers) specific IP address and port combinations. Public access into the organization’s internal networks is prevented except as appropriately mediated."
                  }
                ]
              },
              {
                "uuid": "f2d6eb76-c5e1-4678-ac98-8c2e7ccb742a",
                "control-id": "sc-12",
                "description": "sc-12 statements",
                "statements": [
                  {
                    "statement-id": "sc-12_smt",
                    "uuid": "0375e393-26ae-4846-a4db-8163dfc7fc6f",
                    "description": "Use of cryptographic key management for the Project system is in use for at the time of implementation for authentication. CivicActions utilizes customer agency supplied PIV credentials for access to customer instances of the Project. Access enforcement and authentication requirements for Project are described in AC-2 & IA-2. AWS platform does not utilize or manage cryptographic keys within the ACE boundary."
                  }
                ]
              },
              {
                "uuid": "fabe78d3-9e4f-4dee-8a04-87fc110652d1",
                "control-id": "sc-15",
                "description": "sc-15 statements",
                "statements": [
                  {
                    "statement-id": "sc-15_smt",
                    "uuid": "db3a52ec-ad54-4a69-9c24-a28aab1bedee",
                    "description": "This control is not applicable, as the Project system does\nemploy any collaborative computing devices."
                  }
                ]
              },
              {
                "uuid": "43d4955f-92c6-4896-9974-6fbcb66e9e1e",
                "control-id": "si-1",
                "description": "si-1 statements",
                "statements": [
                  {
                    "statement-id": "si-1_smt",
                    "uuid": "8fc2acf6-2780-4130-954f-929b893c0997",
                    "description": "System and information integrity policy and procedures for the Project system are formally documented in the Project SSP, which provides the roles and responsibilities as it pertains to physical and environmental protection systems. The Project system support staff monitors the network on a daily basis and employs up-to-date patches to protect the integrity of the system.\n\nAdditional information is contained within the None.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog."
                  }
                ]
              },
              {
                "uuid": "d416292e-2ccd-4aaf-a05f-23d636723ed2",
                "control-id": "si-5",
                "description": "si-5 statements",
                "statements": [
                  {
                    "statement-id": "si-5_smt",
                    "uuid": "2ea48bde-f2c0-4324-807d-8ecd7551349b",
                    "description": "Project representatives and system administrators receive alerts from US-CERT on a regular basis. Support personnel take appropriate action in response to relevant areas of concern."
                  }
                ]
              },
              {
                "uuid": "6f06c275-cbdd-4ba1-96ab-78cae417470a",
                "control-id": "si-12",
                "description": "si-12 statements",
                "statements": [
                  {
                    "statement-id": "si-12_smt",
                    "uuid": "329baeb3-530b-4abd-bda8-4e38a85d3012",
                    "description": "Project representatives and systems administrators receive annual training from Client regarding information assurance and information handling requirements. These personnel are required to operate the system and handle system data and output in accordance with legal requirements. Personnel training and system guidelines ensure that data and programs are handled appropriately."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}
