{
  "component-definition": {
    "uuid": "ccf8d48b-555d-4ba0-b624-7b7caf099a51",
    "metadata": {
      "title": "Contractor Responsibilities",
      "published": "2021-09-03T22:02:52.782251+00:00",
      "last-modified": "2021-09-03T22:02:52.782255+00:00",
      "version": "unknown",
      "oscal-version": "1.0.0"
    },
    "components": [
      {
        "uuid": "6708fec3-9870-49b1-b11a-aea2c3587cce",
        "type": "software",
        "title": "CivicActions",
        "description": "CivicActions",
        "control-implementations": [
          {
            "uuid": "3b819f98-4fd2-423f-ae5e-005f5b10e1dd",
            "source": "https://raw.githubusercontent.com/usnistgov/oscal-content/master/nist.gov/SP800-53/rev4/json/NIST_SP-800-53_rev4_catalog.json",
            "description": "NIST_SP80053r4",
            "implemented-requirements": [
              {
                "uuid": "98b4640a-8bd0-46b5-8167-91a15473443c",
                "control-id": "ac-1",
                "description": "CivicActions has developed, documented and disseminated to personnel an access control policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Access Control (AC) Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "6ed35f63-8b1a-46a9-86c7-8f1a9884b411",
                "control-id": "ac-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ac-2_smt.b",
                    "uuid": "7a065e6b-614d-41e7-96f1-554f23c94306",
                    "description": "The CivicActions Project Manager assigns the \"administrator\" role for the management of all accounts issued to internal admin roles supporting the information system.  Account requests are initiated by the Project Manager by completing a ticket request and the CivicActions Operation staff manages the account creation process."
                  },
                  {
                    "statement-id": "ac-2_smt.d",
                    "uuid": "131d628d-9cac-41ca-a364-d4cf4e4febae",
                    "description": "All accounts issued for application administrators and SSH are documented in CivicActions' ticketing system. Account request tickets contain details that explain the attributes for the account including authorized users of Drupal, system infrastructure, group and role membership, and access authorizations."
                  },
                  {
                    "statement-id": "ac-2_smt.e",
                    "uuid": "099f0c55-61e1-409e-bc8a-669ed655ebca",
                    "description": "All accounts issued for the admin management of Application or SSH access must be approved by the System Owner or Project Manager who must create an account request. The CivicActions Operations staff applies appropriate account permissions and settings based on the job role and function documented within the request ticket using processes defined by the CivicActions' Security Office."
                  },
                  {
                    "statement-id": "ac-2_smt.f",
                    "uuid": "1045c59f-4e70-4fdf-8fa0-c3ead9bb55e4",
                    "description": "CivicActions Operations staff is responsible for the following account management activities for both internal administrative users and customer accounts:\n\n- Establishing account justification\n- Activating accounts\n- Modifying accounts\n- Expiring accounts\n- Disabling accounts\n- Removing accounts"
                  },
                  {
                    "statement-id": "ac-2_smt.g",
                    "uuid": "d2a7ccc1-d478-4fa3-99bc-fc4ea7de0ffe",
                    "description": "All CivicActions systems log the usage of information accounts."
                  },
                  {
                    "statement-id": "ac-2_smt.h",
                    "uuid": "5da5d1b8-2180-4d0b-9552-cdfca3452ded",
                    "description": "In accordance with the CivicActions Access Control (AC-01) Policy when an account is no longer required, the Project Manager notifies the Operations Team to immediately disable all access. Users upon reassignment, change in roles, termination, or leaving employment are initially removed from all roles and groups, effectively denying them all access to privileged accounts."
                  },
                  {
                    "statement-id": "ac-2_smt.i",
                    "uuid": "5bb12697-f2b5-4b9f-be3d-383b6afbc5fb",
                    "description": "System accounts require access authorizations prior to accounts being created. The Project Manager must initiate an access request for an account to be created. CivicActions Operations staff reviews the request to ensure accuracy, including intended system usage and other attributes of the user access being requested."
                  },
                  {
                    "statement-id": "ac-2_smt.j",
                    "uuid": "29d6a2ed-ac0e-4acb-a0ec-b9de9c8afbd1",
                    "description": "All privileged accounts are reviewed by CivicActions Operations staff every 180 days."
                  },
                  {
                    "statement-id": "ac-2_smt.k",
                    "uuid": "948887ad-4e4c-410c-9977-68680b938680",
                    "description": "In accordance with standard security best practices and CivicActions policy, shared and reissued accounts for internal accounts of any kind are not created nor used for any purpose in any system."
                  }
                ]
              },
              {
                "uuid": "7569f8df-6505-4e65-ae7b-55091607b9a1",
                "control-id": "ac-17",
                "description": "The CivicActions Access Control (AC) policy defines policy for remote usage restrictions. The Project Manager or System Owner may additionally provision users according to their Access Control policies."
              },
              {
                "uuid": "13ea3aa4-608a-4689-8e43-6d573926d1d1",
                "control-id": "ac-18",
                "description": "This control is not applicable. The system does not provide wireless access points."
              },
              {
                "uuid": "5ec65108-de0a-47bb-8101-4367d776ee7f",
                "control-id": "ac-19",
                "description": "This control is not applicable. The system does not maintain a facility in which mobile device access limitations are required."
              },
              {
                "uuid": "adbb3eb0-b3a4-4c85-b5f8-c3ffb8e323f0",
                "control-id": "ac-20",
                "description": "This control is not applicable. The system does not connect with external information systems."
              },
              {
                "uuid": "64f56edf-24b4-4a6f-a425-fabbd65c1c67",
                "control-id": "at-1",
                "description": "CivicActions has developed, documented and disseminated to personnel awareness and training policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Awareness and Training (AT) Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "673f6db6-41ac-4043-8e2c-22a4e3e4ff3a",
                "control-id": "at-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "at-2_smt.a",
                    "uuid": "12d40c74-29cf-4654-9e06-561a4e4087b9",
                    "description": "Both regular and ad hoc training to all CivicActions personnel, including those who support the system infrastructure and applications, is provided. All employees and contractors must complete Security Awareness training upon being hired and at least annually thereafter. CivicActions Operations staff will not create accounts for individuals until they have successfully completed the trainings. Additional training will be provided as required by system changes. Training takes the following forms:\n\nAnnual Knowledge Survey (i.e., Security Awareness Training): All employees are required to review trainings covering Security Awareness. After the training, a survey-style security awareness test is taken by employees. All CivicActions personnel are required to complete and pass the survey, and new employees are required to pass before being granted access to the Information System. In order to successfully pass the test, a score of 80% is required. This survey tests CivicActions personnel’s knowledge of critical security subjects, policies and procedures. Results from this survey are compiled by the Office of Human Resources and used to refine future training efforts.\n\nAd Hoc Security Awareness: The CivicActions' Security Office oversees the approximately bi-monthly distribution of security awareness tips and articles to all CivicActions employees. This can include general tips as well as articles tailored to the specific requirements of CivicActions users."
                  },
                  {
                    "statement-id": "at-2_smt.b",
                    "uuid": "ea3064bc-fdfc-4e99-a833-72e535738b68",
                    "description": "In the event of a major system change, the Project Manager is responsible for delivering additional training to impacted personnel. Specific training types, mediums, and delivery methods are dependent upon the nature of the system change."
                  },
                  {
                    "statement-id": "at-2_smt.c",
                    "uuid": "4e154af6-988e-42be-9a7c-3da13f25de92",
                    "description": "CivicActions provides annual security awareness training to its personnel."
                  }
                ]
              },
              {
                "uuid": "9b90bc4d-3b28-4a94-a219-f470d3fb0e07",
                "control-id": "at-3",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "at-3_smt.a",
                    "uuid": "1d7a128d-23d5-4513-a9ea-d8586fc32d0f",
                    "description": "CivicActions personnel with security responsibilities are required to complete role-based security training before being provided with access to the information system. The CivicActions' Security Office is responsible for creating the content of the training. The role-based training is provided and tracked by the CivicActions Security Office."
                  },
                  {
                    "statement-id": "at-3_smt.b",
                    "uuid": "20f1e62d-f552-48b6-b4e8-80347b38bd44",
                    "description": "The Project Manager in collaboration with CivicActions Security Office determines whether a change to the information system requires any modifications and updates to the security awareness training program and if so, works with the CivicActions' Security Office to implement the change."
                  },
                  {
                    "statement-id": "at-3_smt.c",
                    "uuid": "5d55e967-d78b-4c8f-aff1-0cecdc67dc67",
                    "description": "CivicActions Security Office provides users with security responsibilities role-based security training on an annual basis. The training is provided and tracked by the CivicActions Security Office."
                  }
                ]
              },
              {
                "uuid": "acad1614-6b6a-4284-ac9a-17810b7a8d22",
                "control-id": "at-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "at-4_smt.a",
                    "uuid": "45ffa8a9-10f9-483a-a09f-197be80b3773",
                    "description": "The CivicActions' Security Office tracks all security awareness training within the organization and ensures that all employees have successfully completed training when required. The training records are stored and tracked in a spreadsheet maintained by the CivicActions Security Office."
                  },
                  {
                    "statement-id": "at-4_smt.b",
                    "uuid": "da07ea67-bc29-46c0-a767-58d04b558ce3",
                    "description": "Training records are tracked and maintained by the CivicActions Security Office. Records are maintained permanently."
                  }
                ]
              },
              {
                "uuid": "48eac5ce-1d48-4c4d-b957-9e93138c48fa",
                "control-id": "au-1",
                "description": "CivicActions has developed, documented and disseminated to personnel an audit and accountability policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Audit and Accountability (AU) Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "bc320e93-9d4b-4f06-99c1-23e4d40dbaad",
                "control-id": "au-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "au-2_smt.a",
                    "uuid": "c50db248-e489-4882-897e-ed3a12157780",
                    "description": "CivicActions' Security Policy provides information about auditing and logging of CivicActions internal users and end-user activity on the servers and within the system application."
                  },
                  {
                    "statement-id": "au-2_smt.b",
                    "uuid": "cf7f4f4d-0649-454f-87c9-841288273caf",
                    "description": "Auditable events may change due to changes in the threat environment. CivicActions teams collaborate internally and also communicate with customers and partner organizations to identify and select auditable events. The teams that participate in this process are described in control SA-3(b)."
                  }
                ]
              },
              {
                "uuid": "2ed67ce8-4031-49ea-875d-457426600739",
                "control-id": "au-4",
                "description": "CivicActions ensures adequate storage capability requirements listed in AU-11 for all events from the application, database, and hosting environment."
              },
              {
                "uuid": "bee960a5-00ab-4401-9748-fcbc1db7b946",
                "control-id": "au-5",
                "description": "When notified (e.g., via CloudWatch) of an auditing failure, CivicActions Operations staff will review the causes and take corrective action."
              },
              {
                "uuid": "b73f0378-5b1b-407e-91b3-fc84e7bd537a",
                "control-id": "au-6",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "au-6_smt.a",
                    "uuid": "eaad9f60-a682-4496-8106-2f54da5ef0b3",
                    "description": "CivicActions security audit data is collected by the AWS CloudWatch monitoring and observability service to support real time and after-the-fact investigation at the application level for the following:\n\n- Indications of inappropriate or unusual activity\n- Assurance that logging is functioning properly\n- Adherence to logging standards identified in this procedure"
                  },
                  {
                    "statement-id": "au-6_smt.b",
                    "uuid": "9537bda3-147a-4b5c-9876-2445ff4064d1",
                    "description": "Any significant findings observed during the inspection are reported to CivicActions' Security Office. If these are considered to constitute a security incident, then the Incident Response process is invoked as described in the implementation of the Incident Response Plan (IR-8)."
                  }
                ]
              },
              {
                "uuid": "0c6122c2-6e4d-4dce-a254-845d1173b2b2",
                "control-id": "au-9",
                "description": "CivicActions ensures that audit logs are created, stored and maintained. Developers who have been assigned as members of the CivicActions Security Office are the only CivicActions personnel with logical permission to access and review audit logs."
              },
              {
                "uuid": "6b6c426c-1005-4e35-a0e5-45f8d6f79a7e",
                "control-id": "au-11",
                "description": "CivicActions audits events from the application, database, and hosting environment, and retains these records for at least 180 days."
              },
              {
                "uuid": "ff0c2873-2334-493b-9d78-1413841884db",
                "control-id": "au-12",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "au-12_smt.a",
                    "uuid": "737e842f-afb9-475a-87da-cc2df70843e3",
                    "description": "CivicActions ensures audit records are generated for its web and event logs as required in AU-2 and AU-3 for servers, application, database, and network components."
                  },
                  {
                    "statement-id": "au-12_smt.b",
                    "uuid": "3786f7fb-b36e-4229-aed3-7b4fdc51d875",
                    "description": "The selected auditable events described in AU-2 are coordinated by CivicActions internal admins and client security/operations officers for each component of the production system."
                  },
                  {
                    "statement-id": "au-12_smt.c",
                    "uuid": "a33427f0-f21a-4976-91cc-5ffcd949b9cc",
                    "description": "CivicActions maintained applications generate audit records for their web and event logs as described in AU-2 and AU-3."
                  }
                ]
              },
              {
                "uuid": "c40b6a07-aa94-4961-be25-0cb56204b78e",
                "control-id": "ca-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a certification, accreditation, and security assessment policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Security Assessment and Authorization Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "6b4f823f-7a04-4d15-8509-3e97428205c5",
                "control-id": "ca-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ca-2_smt.a",
                    "uuid": "ffadf5eb-fa2e-4958-b23c-565c79dbebf9",
                    "description": "CivicActions will develop a security assessment plan (SAP) that describes the security controls and control enhancements under assessment, assessment procedures used to determine effectiveness, the assessment environment, the assessment team, and the assessment roles and responsibilities."
                  },
                  {
                    "statement-id": "ca-2_smt.b",
                    "uuid": "9e3dc7f0-3782-4ee1-bdde-0116bed6a7f7",
                    "description": "CivicActions will assess the security controls in their system and its environment of operation to determine the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting established security requirements.\n\nAll controls assigned and documented in this System Security Plan (SSP) will be tested at least annually or when there is a major change to the system."
                  },
                  {
                    "statement-id": "ca-2_smt.c",
                    "uuid": "9ff9202d-0a95-4555-878b-60c256b62f32",
                    "description": "CivicActions will produce a security assessment report that documents the results of the assessment. The Security Assessment Report must contain the results of the assessment, and may also contain recommendations and suggestions for plans of actions and milestones (POA&Ms)."
                  },
                  {
                    "statement-id": "ca-2_smt.d",
                    "uuid": "5967b894-e5a5-42ac-84ec-2adbe7c6e9c8",
                    "description": "CivicActions will provide the results of the security control assessment to the System Owner, Project Manager, CivicActions Security, and the Authorization Official (AO)). The security control assessment package includes the following:\n\n- Security Control Matrix\n- Privacy Impact Assessment\n- E-Authentication\n- Contingency Plan\n- Configuration Management Plan\n- Rules of Behavior\n- Incident Response Plan"
                  }
                ]
              },
              {
                "uuid": "cd4ace73-1b29-4347-a472-f8541cf501fc",
                "control-id": "ca-3",
                "description": "This control is not applicable. CivicActions systems do not have system interconnections. The only communication conducted to CivicActions' systems is through the Internet."
              },
              {
                "uuid": "9ba806d8-8256-49f6-88f5-013e28db7ad2",
                "control-id": "ca-5",
                "description": "CivicActions documents all deficiencies and vulnerabilities identified during the security certification and/or continuous monitoring phase (via security assessment, vulnerability scanning, risk assessment, etc.) within the Plan of Action and Milestones (POA&M).\n\nThe POA&M document provides a platform for CivicActions to monitor and track the deficiency and its mitigation strategy. POA&M items will include:\n\n- The description of the deficiency,\n- Dedicated point of contact for this deficiency.\n- Cost of the mitigation strategy\n- Associated risk and NIST control\n- Recommended mitigation strategy\n\nPOA&Ms are tracked throughout the lifecycle of the system until its mitigation. All POA&Ms are reviewed on a monthly basis by CivicActions Information System Security Officer to ensure all mitigation strategies are continuing as documented."
              },
              {
                "uuid": "3ca2ea32-bc1a-41e8-b6ed-ef562cbbdca7",
                "control-id": "ca-7",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ca-7_smt.a",
                    "uuid": "ef510dfa-d299-49af-985a-ac86b2d199dc",
                    "description": "CivicActions implements a continuous monitoring strategy that incorporates configuration management, system scanning and log analysis processes:\n\n- Configuration management includes the assessment of security impact analyses of proposed and implemented changes.\n- System scanning is managed by running the OpenSCAP vulnerability scanner using the DISA STIG profile.\n- Log analysis is managed by feeding logs to a Graylog dashboard for analysis."
                  },
                  {
                    "statement-id": "ca-7_smt.b",
                    "uuid": "bb3da305-84dc-4e10-9212-11aed8cc2fda",
                    "description": "Configuration management and log analysis is carried out in real time. OpenSCAP security scans are performed and reviewed monthly. See also: RA-5 and SI-4.\n\nQuarterly review of the control assessments supporting the monitoring is conducted by CivicActions Operations in collaboration with the CivicActions Security Office."
                  },
                  {
                    "statement-id": "ca-7_smt.d",
                    "uuid": "77e3b867-d3b8-43f0-93c7-c4696c15321c",
                    "description": "CivicActions conducts or oversees continuous system security monitoring."
                  },
                  {
                    "statement-id": "ca-7_smt.e",
                    "uuid": "f491cc82-5bb4-4b2f-9525-175ef53e0889",
                    "description": "CivicActions Security reviews the results of the security scans and security assessments with associated JIRA and/or GitLab Issue tickets created to correlate and analyze security-related information generated from the monitoring tools becoming POA&M items for tracking."
                  },
                  {
                    "statement-id": "ca-7_smt.f",
                    "uuid": "e5613173-4eed-42fb-8271-48e714339474",
                    "description": "POA&M items are tracked by CivicActions Security through JIRA tickets with a security categorization assigned. The information included in the POA&M item include the severity, the due date, the weakness source identifier, and the plugin ID that identified the vulnerability."
                  },
                  {
                    "statement-id": "ca-7_smt.g",
                    "uuid": "a5685211-5253-4eaa-95ae-9d0c7f9f4655",
                    "description": "The security status of the system is reported up to the System Owner and Project Manager via the CivicActions Security Office to be reviewed alongside other security issues relating to the system."
                  }
                ]
              },
              {
                "uuid": "21989f1c-d00d-4dc5-a456-987d9eec2dd8",
                "control-id": "ca-9",
                "description": "Not applicable."
              },
              {
                "uuid": "38ff8fa6-4d15-4302-b088-df509adcb7b6",
                "control-id": "cm-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a configuration management policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Configuration Management (CM) Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>.\nConfiguration changes are overseen by the Change Control Board (CCB) consisting of the System Owner, Project Manager, CivicActions Operations staff and the engineering team."
              },
              {
                "uuid": "c68c9b87-0201-4a6d-9a5e-0a79a8ceb98f",
                "control-id": "cm-2",
                "description": "A current baseline configuration is always available - stored as a tag in the Git repository - such that the site can be regenerated or rolled back should unauthorized or failing changes be applied."
              },
              {
                "uuid": "316982c4-24de-4bbf-82c4-6f81451a4e30",
                "control-id": "cm-4",
                "description": "Security impact analysis is conducted and documented within the Change Request (CR) process described in CM-3(b). All proposed configuration- controlled changes to the application are tested first in a sandboxed development environment before being pushed to a staging environment to be tested by another developer and by the Engineering team prior to final approval from CCB to move changes to the production environment."
              },
              {
                "uuid": "63b81f7e-fd9e-4d40-a5d5-3e027bccd7ae",
                "control-id": "cm-6",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "cm-6_smt.b",
                    "uuid": "2d4d79a3-1625-4424-9845-0bba1d655bd5",
                    "description": "CivicActions developers follow security best practices according to the guidelines set by the CivicActions Security Office."
                  },
                  {
                    "statement-id": "cm-6_smt.d",
                    "uuid": "7ab439af-2ad7-4f9b-a4ee-4263cf53b3af",
                    "description": "All changes to the configuration settings are logged in the Git source code version control system, which records the identity of the developer who committed each change. Version control is enforced, with previous tagged code releases kept for rollback purposes."
                  }
                ]
              },
              {
                "uuid": "102c7ee0-ad61-4727-b823-ef3a1be89c5e",
                "control-id": "cm-10",
                "description": "Drupal is hosted on a LAMP platform (Linux, Apache, MySQL, and PHP). These are all compatible with the Free Software Foundation's General Public License (GPL) version 2 or later and are freely available for use under copyright law."
              },
              {
                "uuid": "e2f7b3a0-d7ba-4990-84ed-7d4d82d0645b",
                "control-id": "cm-11",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "cm-11_smt.a",
                    "uuid": "46cd7a0a-cd0f-4ee4-969c-c2c4a3b8248e",
                    "description": "All software installed in the system environment must be first approved via the CCB resulting in a Change Request (CR) being initiated and executed. Software installation on the computing nodes within the authorization boundary is restricted to administrators. All CivicActions internal administrators are informed of this during their initial training and as part of the rules of behavior document."
                  },
                  {
                    "statement-id": "cm-11_smt.b",
                    "uuid": "1ba1b814-f2bd-4414-a2e5-b2ed05178740",
                    "description": "CivicActions enforces software installation policies through required acknowledgment and sign-off on acceptable use policy by CivicActions personnel. CivicActions Development is responsible for enforcing compliance with the acceptable use policy."
                  },
                  {
                    "statement-id": "cm-11_smt.c",
                    "uuid": "b2e36d02-fbbc-4276-af8b-e3428d746069",
                    "description": "CivicActions monitors policy compliance continuously via the code release planning and quality control systems built into the System Development Life Cycle described in control SA-3."
                  }
                ]
              },
              {
                "uuid": "cd48a1c5-2d10-4211-836e-402d116346b2",
                "control-id": "cp-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a contingency planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in Contingency Planning (CP) Policy and Procedure that can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "48646ee7-4098-4265-96b1-066b1f7a4dd8",
                "control-id": "cp-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "cp-2_smt.a",
                    "uuid": "137d41f3-987e-4da6-8d92-104842e6a01c",
                    "description": "CivicActions has developed a contingency plan for that addresses:\n1. Essential missions, business functions, and associated contingency requirements\n2. Recovery objectives, restoration priorities, and metrics\n3. Roles and responsibilities are identified in the CP and include the ISCP Director, Incident Commander (IC), CivicActions Coordinator, and CivicActions Information System Security Officer (ISSO).\n4. Maintaining essential missions and business functions despite an information system disruption, compromise, or failure\n5. Full information system restoration without deterioration of the security safeguards originally planned and implemented\n6. The ISCP is reviewed and approved by ISCP Director, Incident Commander (IC), CivicActions ISSO and the System Owner annually."
                  },
                  {
                    "statement-id": "cp-2_smt.b",
                    "uuid": "c37907be-06be-4ed9-ac84-b8211d4b2d67",
                    "description": "The CivicActions Information System Contingency Plan (ISCP) has been distributed to all CivicActions team members. The ISCP can be found in the CivicActions Handbook at <https://civicactions-handbook.readthedocs.io/en/latest/09-security/contingency-plan>."
                  },
                  {
                    "statement-id": "cp-2_smt.c",
                    "uuid": "86b163d7-c824-4a75-bd7c-167e39befc9c",
                    "description": "The Information System Contingency Plan (ISCP) is closely integrated with the Incident Response Plan (IRP). Coordination is the responsibility of the ISCP Director and CivicActions Operations staff."
                  },
                  {
                    "statement-id": "cp-2_smt.d",
                    "uuid": "af362139-7369-49bc-86ea-96d574ac4516",
                    "description": "The ISCP Director and CivicActions' Security Office are responsible to review the ISCP annually and when a change to the system occurs."
                  },
                  {
                    "statement-id": "cp-2_smt.e",
                    "uuid": "ec988acf-bb38-4045-a0ad-d78a387e943d",
                    "description": "CivicActions Operations staff and ISCP Director are required to update the ISCP to address changes to the organization, information system, or environment of operation and problems encountered during contingency plan implementation, execution, or testing."
                  },
                  {
                    "statement-id": "cp-2_smt.f",
                    "uuid": "6617c3f5-7dca-453a-b44b-70caec329664",
                    "description": "The ISCP requires that changes to the plan be communicated to those on the Incident Response/Contingency Plan Contact List."
                  },
                  {
                    "statement-id": "cp-2_smt.g",
                    "uuid": "de8559e3-6255-44d3-bfed-ffdea8eec22e",
                    "description": "The ISCP is available on CivicActions GitHub repository. This repository provides the configuration management capabilities for the ISCP to be protected from unauthorized disclosure and modification."
                  }
                ]
              },
              {
                "uuid": "ab7c3667-8e68-443a-b443-52bfac77f164",
                "control-id": "cp-3",
                "description": "The ISCP stipulates that all CivicActions system assigned roles in the Contingency Plan Team are trained in their duties within three months of first being assigned a role in the CP, and then annually thereafter or when changes are required. CivicActions uses the Contingency Plan as described in controls CP-1 and CP-2 as a basis for personnel contingency training."
              },
              {
                "uuid": "a07d7360-b5ef-4acb-872f-b7c8c6fb21f4",
                "control-id": "cp-4",
                "description": "Real-world tests of the contingency plan will be held at least annually, with supplemental tests (checklist/table-top) as needed for specific scenarios. The ISCP Coordinator is responsible to facilitate annual testing exercises. The testing process for the ISCP includes a review of the ISCP, exercise, and identification of corrective actions and other improvements."
              },
              {
                "uuid": "0057c380-7c9b-4d91-a09e-81068d47d455",
                "control-id": "cp-9",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "cp-9_smt.a",
                    "uuid": "d49aacf3-fed7-4f7b-b8ca-ad35759321b2",
                    "description": "CivicActions conducts system user-level information backup in accordance with requirements (at a minimum, incremental backups must be conducted at least weekly and full backups must be conducted at least monthly)."
                  },
                  {
                    "statement-id": "cp-9_smt.b",
                    "uuid": "d9434d2a-aa47-4caf-b355-1160502c77d1",
                    "description": "System-level information for the application is replicated and backed up in the same way as user-level information as defined in CP-9(a)."
                  },
                  {
                    "statement-id": "cp-9_smt.c",
                    "uuid": "7f5b5c6e-f0cb-4234-9b43-30a1b81151bd",
                    "description": "System documentation is backed up from the GitHub repository on a daily basis with a minimum two-week retention period and off-site storage."
                  },
                  {
                    "statement-id": "cp-9_smt.d",
                    "uuid": "8c73854d-d700-42e2-8099-1963be546693",
                    "description": "CivicActions employees must authenticate prior to being granted access to the GitHub repository. Roles and responsibilities within GitHub determine the proper level of access for the documentation being accessed. The folder structure of GitHub protects though permissions and ownership prohibiting users from accessing unauthorized documentation."
                  }
                ]
              },
              {
                "uuid": "f9e642b7-a3da-475b-aae2-5ca303351d77",
                "control-id": "cp-10",
                "description": "The Contingency Plan documents the mechanisms with supporting procedures that allow all system components to be recovered and reconstituted to the system’s original state after a disruption or failure. This original state means that all system parameters (either default or organization- established) are reset, patches are reinstalled, system and security configuration settings are reestablished, system documentation and operating procedures are available, application and system software is reinstalled, information from the most recent backups is available and the system is fully tested."
              },
              {
                "uuid": "b6936a75-6c33-45f6-87cd-f3413761aff7",
                "control-id": "ia-1",
                "description": "CivicActions has developed, documented and disseminated to personnel an identification and authentication policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained by the CivicActions Identification and Authentication (IA) Policy. This document can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "9823b617-3d8a-4a99-b4c7-d0e80ec7b5ec",
                "control-id": "ia-2.1",
                "description": "CivicActions system administrators employ a personal public- key pair for basic access and must originate from a whitelisted IP address. The whitelist is maintained by an Ansible inventory file, the current complete list (includes dev sites) of users with whitelisted IPs is in artifact: None\n\nTo access root (sudo) privileges an additional password is required. The passwords are maintained in encrypted form in the Ansible inventory file. The mechanism to enable select users to use a password to obtain root access can be viewed in artifact: None"
              },
              {
                "uuid": "82802674-bffc-4da1-9b92-76b701c6bb91",
                "control-id": "ia-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ia-4_smt.a",
                    "uuid": "5568d15a-288e-46d8-bc43-e3c0c84de5f9",
                    "description": "Access to the system is authorized by the System Owner or Project Manager for each role as described in AC-2."
                  },
                  {
                    "statement-id": "ia-4_smt.b",
                    "uuid": "154a4c61-9f49-4dde-9c9d-60da40bfadf6",
                    "description": "User accounts are assigned a unique identifier in the form of a unique username, password and email address based on the system for allocating user accounts described in AC-2.\n\nIn accordance with CivicActions Identification and Authentication (IA) Policy outlined at <https://github.com/CivicActions/compliance-docs>, CivicActions internal users are uniquely identified by the creation of an organizational account with a username based on each user's first and last names."
                  },
                  {
                    "statement-id": "ia-4_smt.c",
                    "uuid": "67ab3d57-4217-41c0-81b5-1cf34f09cf00",
                    "description": "User accounts are assigned a unique identifier in the form of a unique username, password and email address based on the system for allocating user accounts described in AC-2."
                  },
                  {
                    "statement-id": "ia-4_smt.d",
                    "uuid": "7decbd94-cfa7-4191-9ac3-ef9e62c6d939",
                    "description": "Account usernames may not be re-used for at least two years."
                  },
                  {
                    "statement-id": "ia-4_smt.e",
                    "uuid": "7a9ce5fa-0fb5-4ab2-a8f7-5a9d801ade2f",
                    "description": "All user accounts are required to change their passwords every 90 days. The website will automatically block the accounts of users who fail to change their password within that time period, after which the account may only be unblocked by a website Administrator or CivicActions Operations staff."
                  }
                ]
              },
              {
                "uuid": "7bbf64bf-6e43-473b-9b3e-2c5bd9ae27e6",
                "control-id": "ia-5",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ia-5_smt.i",
                    "uuid": "ba165278-bbd1-4887-ab9d-1034d4dd6642",
                    "description": "CivicActions users are required to take appropriate measures in the handling of passwords including:\n\n- Not transmitting user names and passwords together in an unencrypted format\n- Not permitting the sending of passwords in an unencrypted format via email\n- Not listing passwords in tickets\n- Not writing down or storing passwords in a readable form in any physical or logical location where they may be discoverable by unauthorized persons."
                  }
                ]
              },
              {
                "uuid": "6c3479a2-0cf7-441e-9ba6-4c61dd93d34b",
                "control-id": "ia-7",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ia-7_smt.j",
                    "uuid": "877c3d64-a3d7-4d74-9965-20686f3c43cf",
                    "description": "CivicActions systems employ authentication methods consistent with NIST FIPS 140-2 requirements. General public access to system web pages does not require cryptographic authentication. Privileged users accessing systems use the public-key cryptographic functionality of Secure Shell (SSH) to encrypt the exchange of information (including the password) between the remote user and the server. Where Transport Layer Security (TLS, aka SSL) is used, cryptographic modules will be configured in accordance with FIPS 140-2."
                  }
                ]
              },
              {
                "uuid": "680eef70-6d26-4432-8022-7df86017bae7",
                "control-id": "ir-1",
                "description": "CivicActions has developed, documented and disseminated to personnel an incident response planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in Incident Response (IR) Policy and Procedure that can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "0899582f-fb07-4d08-a943-8aa0fa453115",
                "control-id": "ir-2",
                "description": "All CivicActions employees are required to participate in incident response training, as required by Incident Response Plan changes, and annually. The CivicActions Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) is the basis for the training and the incident response workflow created by the Security Office. Upon a review of past incidents, the training is updated to ensure processes and workflows are updated."
              },
              {
                "uuid": "3c15c63f-edf8-4c53-b51f-890122401035",
                "control-id": "ir-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ir-4_smt.a",
                    "uuid": "d79c414c-423b-4326-a018-4bf9fe9cf02b",
                    "description": "CivicActions has implemented an Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) that explains the process for incident handling and discusses preparation, detection and analysis, containment, eradication, and recovery.\nPreparation activities include all CivicActions team members who are trained in incident response. Detection and monitoring tools providing notification to incident response personnel for analysis and action."
                  },
                  {
                    "statement-id": "ir-4_smt.b",
                    "uuid": "e9096485-9930-427f-8337-64a361760cbb",
                    "description": "CivicActions' Operations staff and Security Office team members are members of the CivicActions Contingency and Incident Response Plan teams which coordinates activities accordingly through the life of the incident event."
                  },
                  {
                    "statement-id": "ir-4_smt.c",
                    "uuid": "ba73cf08-6ae2-49d0-88b4-70977f8c954e",
                    "description": "The CivicActions Operations staff and Security Office conduct a post-incident analysis to assist in documenting lessons learned and suggesting changes to improve the incident response process. Tickets created in response to the incident event are reviewed upon completion by the Operations staff and Security Office. Changes to the Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) require a team review session for approval."
                  }
                ]
              },
              {
                "uuid": "948acf36-a4ff-4b88-8b11-401e7e50ee78",
                "control-id": "ir-5",
                "description": "CivicActions utilizes the JIRA ticketing tool for tracking and reporting of incident events from reporting to resolution and post- incident analysis. Initial reporting can come from continuous monitoring tools as well as client and public submissions made to support@civicactions.com. Jira processes the tickets for the public submissions and the CivicActions Support Team creates associated GitHub Issues. Internal incidents reported are processed within the GitHub Issue queue. Details of the handling procedures are included in the CivicActions Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan/#response-process>) Response Process."
              },
              {
                "uuid": "a72593c0-d310-4b6e-bec1-d62e9e446579",
                "control-id": "ir-6",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ir-6_smt.a",
                    "uuid": "ebdc070a-10b8-4a91-9377-20e84bc929a3",
                    "description": "CivicActions personnel, as soon as an incident event is detected and/or communicated, are required to report the incident event to the CivicActions Security Office. Methods of detection and/or communication may include one or more of:\n\n- Through continuous monitoring tools (StatusCake, OSSEC, others).\n- As a result of application notifications where CivicActions Security receives notifications (AIDE, OpsGenie, others).\n- Event logging described in AC-2\n- Host-based alerts from the cloud infrastructure or platform."
                  },
                  {
                    "statement-id": "ir-6_smt.b",
                    "uuid": "0d04b40b-3af0-4313-812f-bdbe17d59e48",
                    "description": "CivicActions personnel, as soon as the incident event is detected and/or communicated, are required to report the incident event to the CivicActions Security Office."
                  }
                ]
              },
              {
                "uuid": "35c0d898-953b-470a-b7b4-c73adb27efd1",
                "control-id": "ir-7",
                "description": "CivicActions Help Desk team provides first response assistance to any users of the system. Response time for external reporting of incidents through e-mail is one business day. Internal users are able to request support thought the same process or initiate the incident response workflow. Tickets created in the Jira (customer ticketing system) and GitLab (internal ticketing system) documents all details related to the incident to assist the Incident Response Teams in handling the incident."
              },
              {
                "uuid": "6bbe6086-34b1-4da4-b404-6325dcecdf51",
                "control-id": "ir-8",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ir-8_smt.a",
                    "uuid": "a07eb474-98de-4457-8143-b5abd5de3233",
                    "description": "Incident response plays a pivotal role in monitoring, detecting and handling security incidents of the entire information system. CivicActions has developed an Incident Response Plan (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>) that:\n\n1. Provides CivicActions with procedures and tools required for incident handling;\n2. Describes the structure and organization of the incident response capability;\n3. Provides a high-level approach for how the incident response capability fits into CivicActions and the systems it maintains;\n4. Meets the mission, size, structure, and functions of CivicActions;\n5. Defines reportable incidents;\n6. Provides metrics for measuring the incident response capability and details categorization of incidents in accordance with NIST 800-61;\n7. Defines the roles and responsibilities of CivicActions IR Team;\n8. Is reviewed annually and updated as needed by the CivicActions Security Office, with the assistance of the Incident Response Team."
                  },
                  {
                    "statement-id": "ir-8_smt.b",
                    "uuid": "53e0e101-0382-45b4-8d2f-09d22f675933",
                    "description": "The CivicActions Incident Response Plan is distributed to all CivicActions team members as part of the CivicActions Handbook (<https://civicactions-handbook.readthedocs.io/en/latest/09-security/incident-response-plan>).\n The Incident Response Team includes members from the Security Office,\n Operations staff, and Drupal Engineering teams."
                  },
                  {
                    "statement-id": "ir-8_smt.c",
                    "uuid": "959b08c2-cf0b-434b-aa08-915634bb7250",
                    "description": "The CivicActions Security Office and the Incident Response team is responsible for reviewing the Incident Response Plan annually. The entire Incident Response Team will review the plan and update it as necessary. Ultimately, the Security Office has the final say and will approve all updates to the plan."
                  },
                  {
                    "statement-id": "ir-8_smt.d",
                    "uuid": "1ea46e97-a8de-47e2-b86a-f57f137fae07",
                    "description": "The CivicActions Security Office is responsible for managing the IR Plan, including annual reviews and updates. The IR Plan is updated to reflect any changes to processes, systems or applications. In addition, any concerns or difficulties encountered during IR Plan implementation, execution, or testing are addressed in an update to the IR Plan."
                  },
                  {
                    "statement-id": "ir-8_smt.e",
                    "uuid": "49be1b4d-9f4e-490f-b1c2-c44008014e6f",
                    "description": "Modifications to the IR Plan are conducted by the IR team the (CivicActions Security Office, Operations staff and Engineering teams) and communicated to the CivicActions team."
                  },
                  {
                    "statement-id": "ir-8_smt.f",
                    "uuid": "fd88abf1-9d77-45eb-897a-d05b344737d4",
                    "description": "The IR Plan is available in the CivicActions Handbook and is maintained in the CivicActions GitHub repository. GitHub provides the configuration management capabilities for the IR Plan to be protected from unauthorized disclosure and modification."
                  }
                ]
              },
              {
                "uuid": "2a7cf067-ae23-4f7d-8f29-30d53da64e93",
                "control-id": "ma-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a system maintenance policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Maintenance (MA) Policy and Procedure document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "3f68bcfb-bff7-4ed8-b2b1-4a04c3e1c503",
                "control-id": "ma-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ma-4_smt.a",
                    "uuid": "5d688287-cbb3-4941-bd8a-18999bdaaa23",
                    "description": "System maintenance is done from remote sites as there is no direct access to the server instances in the AWS cloud; this is the government-approved method of doing business. Approval, QA, and monitoring are conducted by the team performing the specific maintenance."
                  },
                  {
                    "statement-id": "ma-4_smt.b",
                    "uuid": "6ba55d3a-85a0-4099-a800-63f6e0308d87",
                    "description": "Remote diagnostics tools, such as OSSEC, AIDE, fail2ban, and OpenSCAP are used to verify the integrity of files, perform log analysis, monitor login attempts and check for rootkits and other vulnerabilities."
                  },
                  {
                    "statement-id": "ma-4_smt.c",
                    "uuid": "6f9a9ff3-5690-4dc0-9d57-e0c8d678bc33",
                    "description": "All nonlocal maintenance requires the same authentication requirements to perform the maintenance activities to access the system as defined in controls AC-3 and IA-2. SSH is used to secure all communications between the remote user and the components located in the AWS cloud."
                  },
                  {
                    "statement-id": "ma-4_smt.d",
                    "uuid": "6ce94342-d52e-45a5-8436-57432ed687d0",
                    "description": "CivicActions records for nonlocal maintenance is managed through JIRA tickets and the Git issue queue as well as normal system logs. CivicActions administrator activity to the system is also logged through the implementation of the AU-2 (Audit Events) and AU-3 (Content of Audit Records)."
                  },
                  {
                    "statement-id": "ma-4_smt.e",
                    "uuid": "cc70a3be-e185-47a3-b910-dcee67ff5d7f",
                    "description": "Any session for internal maintenance activities is terminated when the user completes their session, disconnects from the system, or logs out. In addition, sessions are terminated after 15 minutes of inactivity."
                  }
                ]
              },
              {
                "uuid": "c9c0c4eb-ea99-44f1-b2c1-7a3f49d0e05a",
                "control-id": "ma-5",
                "description": "Maintenance of the system and applications can only be performed by personnel designated as having internal administrator privileges and responsibilities. Access rights for the internal administrators are assigned and granted access to perform their specific job responsibilities. All physical maintenance requirements are inherited from AWS."
              },
              {
                "uuid": "f4bcb68f-3943-4514-910c-48c0460890dd",
                "control-id": "mp-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a media protection policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in CivicActions Media Protection (MP) Policy and Procedure document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "012faa25-bab7-4f65-af5e-2c0591578df7",
                "control-id": "pl-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a system planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Planning (PL) Policy and Procedure document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>."
              },
              {
                "uuid": "de15a990-bf99-4ea2-9e4b-73bcdc5e7069",
                "control-id": "pl-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "pl-2_smt.a",
                    "uuid": "edf7f36d-1d4c-4422-a13c-f26bbd7a4862",
                    "description": "CivicActions has developed this system security plan (SSP) for the information system as part of compliance with NIST 800-53 and FIPS 199. The SSP defines the security categorization, system boundary, and security requirements and controls meeting the requirements of the NIST Risk Management Framework (RMF). Specifically the SSP:\n\n1. Is consistent with the organization’s enterprise architecture\n2. Explicitly defines the authorization boundary for the system\n3. Describes the operational context of the information system in terms of missions and business processes\n4. Provides the security categorization of the information system including supporting rationale\n5. Describes the operational environment for the information system and relationships with or connections to other information systems\n6. Provides an overview of the security requirements for the system\n7. Identifies any relevant overlays, if applicable\n8. Describes the security controls in place or planned for meeting those requirements including a rationale for the tailoring decisions\n9. Is reviewed and approved by the authorizing official or designated representative prior to plan implementation"
                  },
                  {
                    "statement-id": "pl-2_smt.b",
                    "uuid": "5501b164-1ed1-42f1-be70-d315a256b75d",
                    "description": "The SSP is reviewed and approved by the authorizing official prior to plan implementation. A copy of the SSP is provided to authorized CivicActions and assessing personnel including the System Owner, Authorizing Official, Information System Security Officer, System/Network Administrator, and the CivicActions Operations staff. The SSP is maintained by the CivicActions Security Office."
                  },
                  {
                    "statement-id": "pl-2_smt.c",
                    "uuid": "f99113ca-4293-4b07-a603-e3771786f62a",
                    "description": "The SSP is reviewed at least annually by the System Owner and the CivicActions Operations staff in collaboration with the CivicActions Security Office."
                  },
                  {
                    "statement-id": "pl-2_smt.d",
                    "uuid": "b3b45506-b0ed-416a-874e-73c10901fc0e",
                    "description": "The CivicActions Operations staff in collaboration with the CivicActions Security Office updates the system description and control descriptions within the SSP as needed to verify the SSP is an accurate description of the system."
                  },
                  {
                    "statement-id": "pl-2_smt.e",
                    "uuid": "77c7048c-3514-4342-9b1a-e364fb4c9f6e",
                    "description": "The SSP is currently available to authorized users on GitLab. Per the Acceptable Use Policy, all entities granted access to CivicActions information assets are required to complete a non-disclosure agreement (NDA) to uphold information confidentiality. GitLab provides the configuration management capabilities for the SSP to be protected from unauthorized disclosure and modification."
                  }
                ]
              },
              {
                "uuid": "579af2a8-4538-4b5c-9936-0e8a9b095d79",
                "control-id": "pl-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "pl-4_smt.a",
                    "uuid": "4bd1e17d-ee04-4a87-ab6b-385beed97d94",
                    "description": "CivicActions has created and made readily available to individuals requiring access to the information system the rules that describe their responsibilities and expected behavior with regard to information and information system usage. These rules, defined as the Acceptable Use Policy, are included in the CivicActions Security Policy accessible here: <https://civicactions-handbook.readthedocs.io/en/latest/03-policies/security/#acceptable-use-policy> which has also been uploaded to CSAM as ''Appendix J1 - System Rules of Behavior - Privileged User'' (CivicActions Security Policy 20190226.docx).'"
                  },
                  {
                    "statement-id": "pl-4_smt.b",
                    "uuid": "67206db2-4cd8-4129-8d81-aecb359840a9",
                    "description": "CivicActions HR receives a signed acknowledgment from all employees, indicating that they have read, understand, and agree to abide by the rules of behavior, before authorizing access to information and the information system. The text of the electronically signed (via DocuSign) acknowledgment document has been uploaded to CSAM as artifact: ''CivicActions Security Policy Acknowledgement.docx''"
                  },
                  {
                    "statement-id": "pl-4_smt.c",
                    "uuid": "ec04eea2-b8c7-4461-ac66-54e669f8e56d",
                    "description": "CivicActions reviews the CivicActions Security Policy at least annually and updates as required."
                  },
                  {
                    "statement-id": "pl-4_smt.d",
                    "uuid": "6746e6ad-0f74-44a6-8ac0-fcaf4b292b15",
                    "description": "CivicActions requires individuals who have signed a previous version of the CivicActions Security Policy to read and re-sign when any part of it, including the Acceptable Use Policy/Rules of Behavior, is revised/updated."
                  }
                ]
              },
              {
                "uuid": "6d00f39d-8edc-40a6-a5bc-8d3e241ee703",
                "control-id": "ps-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a personnel security policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in CivicActions Personnel Security (PS) Policy document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs>."
              },
              {
                "uuid": "26b34914-63fb-4d7a-bd1a-d52ca298b64c",
                "control-id": "ps-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ps-2_smt.a",
                    "uuid": "1a020c1f-2f07-4727-85f5-e7a98a6a65b9",
                    "description": "Risk designations are assigned to all CivicActions positions. The CivicActions Office of Human Resources works in coordination with the CivicActions Security Office to assign risk designations."
                  },
                  {
                    "statement-id": "ps-2_smt.b",
                    "uuid": "66cfccbb-018a-4fca-b487-88359c09b8a1",
                    "description": "The CivicActions Office of Human Resources works in coordination with the CivicActions Security Office to establish screening criteria for all CivicActions positions."
                  },
                  {
                    "statement-id": "ps-2_smt.c",
                    "uuid": "8875ef9d-0202-4f68-8876-4d3934e0cc93",
                    "description": "At least every three (3) years, the CivicActions Office of Human Resources reviews and revises position risk designations. If the Office of Human Resources determines that significant changes must be made to the position risk descriptions the Office of Human Resources works in coordination with the CivicActions Security Office to implement changes as required."
                  }
                ]
              },
              {
                "uuid": "597229c9-3062-4726-85ae-3f28fc2ef05f",
                "control-id": "ps-3",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ps-3_smt.a",
                    "uuid": "01020ccb-4360-46a2-b89f-6a781f2ac4eb",
                    "description": "Prospective CivicActions employees undergo background checks commensurate with the individual’s job duties, the classification of the information they will access, and the risks associated with the role. At the discretion of the CivicActions Security Office, these checks may also be conducted on contractors and/or third party users in cases where they will have access to application data that is not meant to be consumed by the public. In these instances, the Security Office will instruct the Office of Human Resources to conduct a background check before granting access to the information system."
                  },
                  {
                    "statement-id": "ps-3_smt.b",
                    "uuid": "66bf8717-903b-492f-a124-b7c970481991",
                    "description": "Rescreening is conducted as required by the individual’s job duties, the classification of the information they will access, and the risks associated with the role. A basic background check is performed for all CivicActions employees."
                  }
                ]
              },
              {
                "uuid": "4e981a46-6d4d-4234-a6f0-243ac2dd7e87",
                "control-id": "ps-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ps-4_smt.a",
                    "uuid": "77a89d0d-3263-433c-bb5c-8e78af50bb99",
                    "description": "Information system access is terminated immediately upon the voluntary or involuntary departure of an employee. In the case of involuntary departure, in addition to immediate termination of system access, at no point is a departing employee allowed access to any part of the CivicActions infrastructure.\nIn the case of voluntary departure, employees are permitted access to the information system for the duration of their offboarding period. The departing employee’s manager is responsible for informing the Information Technology department when the employee offboarding period concludes. At this time system and facility, access is terminated."
                  },
                  {
                    "statement-id": "ps-4_smt.b",
                    "uuid": "8b78071f-bc28-405a-9498-d15b1e25d0d3",
                    "description": "The terminated user’s accounts are disabled and all access associated with the individual is revoked."
                  },
                  {
                    "statement-id": "ps-4_smt.c",
                    "uuid": "0840996a-85e6-4f0d-94b2-d7e9dcc6262a",
                    "description": "The employee's manager or the Office of Human Resources conducts exit interviews with all employees who leave CivicActions voluntarily. There is a general discussion about the process of turning in any/all company-issued devices, laptops, etc."
                  },
                  {
                    "statement-id": "ps-4_smt.d",
                    "uuid": "0d3ebbdc-3830-49a4-ab87-c896f5a880c6",
                    "description": "CivicActions employees provide their own equipment that must be hardened to security requirements depending upon their roles and duties. CivicActions supplies two-factor authentication tokens that become the property of the employee.\nSome employees may receive company-issued hardware for working on particular projects. These items are collected before the employee exits CivicActions. In the case of an involuntary termination, the Office of Human Resources works to collect company-issued devices and provides paperwork highlighting confidential protections for customers."
                  },
                  {
                    "statement-id": "ps-4_smt.e",
                    "uuid": "e9b0a3b6-5fda-4245-8762-0e8696c2ac04",
                    "description": "Access to CivicActions information and information systems is always shared so that the termination of an individual will not prevent CivicActions from having access to needed resources."
                  },
                  {
                    "statement-id": "ps-4_smt.f",
                    "uuid": "98064389-9699-4675-bc4c-d4f49826e582",
                    "description": "When a person is terminated, a standard off-boarding process is used to notify management and CivicActions' Operations staff, and to track the process of disabling access to the information system/information system components. The CivicActions Operations staff and Security Office are given at least four hours notice to schedule the deactivation of access upon termination. Deactivation is a manual process that is tracked via a Trello card in order to meet the four hour turnaround time before termination."
                  }
                ]
              },
              {
                "uuid": "7ee576a2-6411-432c-85f5-1e62ce681102",
                "control-id": "ps-5",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ps-5_smt.a",
                    "uuid": "5cf58abd-ed00-4e7e-aa97-dd4a5f275e4a",
                    "description": "When an employee, third party personnel and/or contractor is transferred to a new project or position within CivicActions, they may maintain access to the previous system they were working on in order to facilitate the process of maintenance and knowledge transfer. However, as part of the practices of account management (AC-2) and least privilege (AC-6), regular audits of privileged users are conducted and access privileges may be removed when no longer needed. Additionally, adherence to specific client SLAs may enhance the frequency of such audits or the timeliness of privilege removal during personnel transfer."
                  },
                  {
                    "statement-id": "ps-5_smt.b",
                    "uuid": "c81fea53-9ad0-4ce0-96d1-18215dab0b34",
                    "description": "When an employee, third party personnel and/or contractor is transferred to a new position within CivicActions and there is a requirement for access change, such access changes are normally completed within five business days."
                  },
                  {
                    "statement-id": "ps-5_smt.c",
                    "uuid": "537cd855-e661-47dd-adcc-c32668e1be7a",
                    "description": "Access authorizations are modified as needed to coincide with changes in duties or operational needs upon personnel transfer or reassignment."
                  },
                  {
                    "statement-id": "ps-5_smt.d",
                    "uuid": "6e2870c1-6b9d-4c49-87ae-f7479e5d04b1",
                    "description": "CivicActions Operations staff is informed of transfers that require access authorization modifications within five business days by the Project Manager, System Owner or Office of Human Resources."
                  }
                ]
              },
              {
                "uuid": "2b7b9412-7757-4941-8701-6ac05080b1ed",
                "control-id": "ps-8",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ps-8_smt.a",
                    "uuid": "4be7d281-881a-44bf-9b58-687b0c0bb774",
                    "description": "The CivicActions Security Office and/or the Office of Human Resources is responsible for determining and enforcing sanctions for failing to comply with established information security policies and procedures. Coaching may be considered prior to sanctions. Sanctions may include but are not limited to written warnings, reduction in system access, demotion, or termination."
                  },
                  {
                    "statement-id": "ps-8_smt.b",
                    "uuid": "de34e6be-8674-4ff2-81c7-aefd66fb91bf",
                    "description": "When employee sanctions processes are initiated, the Office of Human Resources notifies the respective Project Manager(s) and CivicActions' Security Office within five business days."
                  }
                ]
              },
              {
                "uuid": "f6b0065f-ecd2-481c-b33a-3f3720a311fa",
                "control-id": "ra-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a risk assessment policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Risk Assessment (RA) Policy and Procedure that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>."
              },
              {
                "uuid": "7eba7b92-d9e8-45c6-b721-597ef0636039",
                "control-id": "ra-5",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "ra-5_smt.a",
                    "uuid": "72f865f8-6db1-4c93-ba86-daac58069392",
                    "description": "CivicActions Operations uses vulnerability scanning software to document and determine risks to the system. Operating system and application vulnerability scans include:\n\n- The CivicActions system environment employs the OpenSCAP scanner with the Red Hat STIG baseline to check for vulnerabilities.\n- The CivicActions application environment is tested by the penetration tester OWASP ZAP, an open-source web application security scanner to report on needed updates based on known flaws.\n\nCivicActions Operations has automated the process to perform the scans on a monthly basis. The resulting reports list vulnerabilities and rank them by severity. These reports are stored in Amazon S3 buckets and are used to inform changes to the system and verify that security controls are working correctly. These scans are used to document the current state of the system, and to analyze security trends as changes are made over time."
                  },
                  {
                    "statement-id": "ra-5_smt.b",
                    "uuid": "1abb625e-b709-4158-a741-5434595ad3f4",
                    "description": "CivicActions employs the automated vulnerability scanning tools OpenSCAP and OWASP ZAP which are interoperable with standard web browsers, the Open Source Ansible infrastructure provisioning system and other Open Source tools."
                  },
                  {
                    "statement-id": "ra-5_smt.c",
                    "uuid": "671f99d8-1ec3-4cc8-b787-763a5268e9b8",
                    "description": "The CivicActions Security Office reviews all vulnerabilities identified from automated scans and security assessments. \"False positive\" findings are documented and may be tailored out. Vulnerabilities found and deemed legitimate are assigned an impact rating and response time thought creation of an issue or ticket. The CivicActions Operations staff reviews current scans and compare with older scans to identify trends and to verify previous vulnerabilities have been mitigated."
                  },
                  {
                    "statement-id": "ra-5_smt.d",
                    "uuid": "2cc2931c-fa17-4d37-8256-7eb47ba2ff0b",
                    "description": "Identified and reported vulnerabilities are assigned an impact rating and response time by CivicActions' Security and must be remediated according to the following time requirements:\n\n- Critical - Within 15 days of discovery (usually within 1 week))\n- High - Within 30 days of discovery (usually within 1 week))\n- Moderate - Within 90 days of discovery (usually within 2 weeks)\n- Low - Within 180 days of discovery"
                  },
                  {
                    "statement-id": "ra-5_smt.e",
                    "uuid": "662842b8-edc7-414e-9793-0621ece4cac4",
                    "description": "Results of the vulnerability scans and security assessments are shared with all appropriate CivicActions personnel supporting continuous monitoring requirements. CivicActions Security assigns each vulnerability an impact rating and response time through JIRA or the Git issue tool for tracking to the established remediation deadlines listed in RA-5(d)."
                  }
                ]
              },
              {
                "uuid": "c03148de-1dab-4550-9c6b-a3d53bbed17f",
                "control-id": "sa-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a system and services acquisition policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained by the CivicActions System and Services Acquisition (SA) Policy document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>."
              },
              {
                "uuid": "1c183cfb-5560-4121-87eb-47d01de0383e",
                "control-id": "sa-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "sa-2_smt.a",
                    "uuid": "48ca19c1-6419-458f-9743-8282b892d7af",
                    "description": "CivicActions' Security Office, in collaboration with the System Owner, act and/or meet on a pre-determined basis to determine information system security requirements and to develop implementation budgets and plans."
                  },
                  {
                    "statement-id": "sa-2_smt.b",
                    "uuid": "7aa07e12-70b2-4888-8efb-23fc466293f8",
                    "description": "The CivicActions Security Office, in collaboration with the System Owner, determines, designates, documents, and allocates the resources required to protect the system as part of its capital planning and investment control processes."
                  },
                  {
                    "statement-id": "sa-2_smt.c",
                    "uuid": "2716bc9e-c68b-4968-8a6b-f6163024019d",
                    "description": "The annual budget developed by the System Owner includes explicit budgetary line items for FISMA security requirements. Additional security-related expenditures that fall outside of explicit compliance requirements are addressed in sub-lines under the CivicActions Information Technology budget."
                  }
                ]
              },
              {
                "uuid": "7d5463f0-4c2b-4200-8dfa-19dae0a34a3c",
                "control-id": "sa-3",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "sa-3_smt.a",
                    "uuid": "8eb82547-b30b-4177-8ed9-9ff5a103b4d4",
                    "description": "The system and application(s) are managed by CivicActions using the Agile software development methodology, which provides a continuous System Development Life Cycle (SDLC) methodology. CivicActions Agile management continues to improve the software through ongoing planned code releases. The process is overseen by the Change Control Board (CCB) as described in CM-1. Each point release introduces code and configuration changes to the website through the following SDLC methodology:\n\n- Code release planning: A code release ticket is created in the Change Request project of the CivicActions ticketing system which describes the overall goals of the code release. The code release ticket is linked to other tickets in the ticketing system which describe issues to be addressed by the planned code release. Those issues may include bug fixes and feature enhancements as well as upgrades to newer versions of the software packages that have been used to build the website.\n- Sprints: The tickets covered by the planned code release are then implemented through a series of planned sprints, each of which typically lasts two weeks. Each sprint begins with a sprint planning session at which the CCB selects a list of tickets to be implemented. CivicActions Development holds daily coordination meetings throughout the sprint to share information and resolve any problems that may be blocking progress toward completion. At the end of the sprint, a retrospective is performed in which progress is reviewed to determine which issues have been resolved and which need further work.\n- Development/unit testing: Work on each ticket is performed within a separate code branch within the CivicActions Git repository, and tested using the GitLab Runner continuous integration platform. Developers also write unit tests to prove their code behaves as expected and address security considerations such as information leakage, bounds checking, and input validation. Once work on a ticket is completed, the developer creates a merge request, and the changes are submitted to at least one other developer for review to ensure they meet functional requirements and address security considerations before the pull request is merged into the Git repository's development branch for the planned code release.\n- Integration testing: Once all work tickets have been completed, the code and configuration necessary to implement the changes are merged into the website's staging server, where it undergoes additional testing to ensure there are no conflicts between the work that has been done on individual tickets.\n- User acceptance testing (UAT): The code release undergoes manual testing against a checklist of expected site behaviors and options each of the website's defined user roles to further verify that the functional changes work as expected and to identify any changes in user experience that need to be documented in release notes to be shared with the customer.\n- Approval for deployment: After all the planned code release has passed all of the above tests, the code release is scheduled for deployment to production and presented to CivicActions' Change Control Board (CCB) for review and approval.\n- Deployment to production: A full backup of the website is performed immediately prior to the deployment.\n- Security scan: After the deployment to production, the website undergoes a security scan using a web vulnerability scanner.\n\n  Security issues to be addressed in the planned code release may come from\na variety of sources:\n- Customer support requests received by the CivicActions Help Desk\n- Security concerns, incidents, and site performance issues reported by users\n- Security incident reports, including server log analysis and root cause analysis of those incidents performed by the CivicActions Security Office and Operations staff\n- Security notifications received by the CivicActions Security Office from external security teams and other software vendors\n- Vulnerabilities detected during security scans of the website performed by the CivicActions Security Office\n- Issues reported by the CivicActions Security Office, Operations staff and Development\n- Security issues reported through continuous monitoring"
                  },
                  {
                    "statement-id": "sa-3_smt.b",
                    "uuid": "b690e8df-5648-4860-af55-052e41b5a58f",
                    "description": "The CivicActions organization defines and documents information security roles and responsibilities throughout the SDLC. The following teams participate in this process:\n\n- Customer Support: Files tickets when incidents are reported and shares incident reports with customers\n- The CivicActions Security Office: Receives security notifications from the Drupal security team and other software vendors; performs security scans; uses CivicActions JIRA ticketing system to request mitigation of all reported vulnerabilities\n- CivicActions Development: Performs server log analysis when security incidents are reported; assists in root cause analysis\n- Change Control Board: Meets weekly to review and approve upcoming planned code changes to the website, include security-related code releases.\n- AWS Cloud: Monitors server and application events; proactively respond to security incidents, and reports incidents to CivicActions\n- Users: Communicates customer security requirements and expectations, and alerts the CivicActions customer support team whenever it detects a security or site performance issue\n\nSecurity responsibilities performed by these teams include the following:\n\n- Perform configuration management during information system design, development, implementation, and operation;\n- Implement only organization-approved changes;\n- Document approved changes;\n- Manage and control changes to the system;\n- Fully test all changes, taking into account security considerations as well as other functional requirements;\n- Track security flaws and flaw resolution; and\n- Employ code analysis tools to examine software for common flaws and document the results of the analysis."
                  },
                  {
                    "statement-id": "sa-3_smt.c",
                    "uuid": "7cf30799-6d12-4092-b781-fd67ec561892",
                    "description": "Each of the CivicActions teams described in SA-3(b) has a team leader who is responsible for defining the roles and responsibilities of individual personnel members within that team. CivicActions uses role-based management for access and authentication implementation and enforcement."
                  },
                  {
                    "statement-id": "sa-3_smt.d",
                    "uuid": "77cb7063-76df-4125-9c59-c9ed4d9b843b",
                    "description": "The CivicActions organization integrates the organizational information security risk management process into system development life cycle activities by requiring that the processes defined in SA-3(a) and (b) above are adhered to by all information system developers and associated security personnel."
                  }
                ]
              },
              {
                "uuid": "6e49c009-8191-4845-9fe9-7e73dc416352",
                "control-id": "sa-4",
                "description": "The CivicActions System and Services Acquisition Policy affects all personnel with purchasing authorization and applies to all purchases or deployments including infrastructure, software or hardware. The CivicActions System and Services Acquisition Policy contains the process for determining acceptance criteria for all system software and application services.\n\nThe Acquisition Security Policy includes an assessment that evaluates the product based on the vendor’s security practices, policies, and past performance. It also details the potential maintenance and end-of-life ramifications with regards to security.\n\nThe CivicActions Security Office is responsible for determining the security documentation that must be included in the information system or services acquisition contracts.\n\nConfiguration and design of the development and production environments are hosted in the CivicActions Git repository. All documentation is strictly controlled regarding transportation and storage in accordance with applicable federal laws, Executive Orders, directives, policies, regulations, standards, guidelines, and organizational mission/business needs."
              },
              {
                "uuid": "6604fc59-ec27-4d68-b445-cbd58b15f849",
                "control-id": "sa-5",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "sa-5_smt.a",
                    "uuid": "34577d19-83c7-40ff-a239-0a69ae5cd730",
                    "description": "Some application features are built on a custom basis and are not part of standard FOSS packages. Administrator documentation for those custom features is maintained in the CivicActions Git repository documentation system."
                  },
                  {
                    "statement-id": "sa-5_smt.b",
                    "uuid": "c6920b45-3e15-4b39-b154-c9f6744d2b28",
                    "description": "The publicly-available FOSS package documentation described in control SA-5(a) also includes user documentation for non-administrators as described in control AC-3. This includes documentation on how to create and manage user accounts as well as how to create, update and delete content.\n\nCivicActions follows the user documentation standard practice to provide context-sensitive help as well as access to a Help Desk in publicly facing applications.\n\nThe CivicActions Customer Support team, described in control SA-3(b), handles questions about how to use the system. Questions are submitted by sending an email to support@civicactions.com, which triggers the creation of a ticket in the CivicActions customer support ticketing system."
                  },
                  {
                    "statement-id": "sa-5_smt.c",
                    "uuid": "0511dee4-51d6-44e1-961c-03d78b87ed64",
                    "description": "If the information needed to answer a question is not already included in the website's public-facing documentation, a ticket is created to determine whether the question is sufficiently general in nature to warrant adding the answer to the website's documentation."
                  },
                  {
                    "statement-id": "sa-5_smt.d",
                    "uuid": "5cfaf947-6422-4b6d-b389-d8b7a1c8d6aa",
                    "description": "All administrator documentation is housed in a protected Git repository. User documentation is publicly available."
                  },
                  {
                    "statement-id": "sa-5_smt.e",
                    "uuid": "46738818-9332-4db6-abec-f9139f757b11",
                    "description": "As needed and approved by the CivicActions Security Office, documentation is available to appropriate personnel by granting access to the private Git repository."
                  }
                ]
              },
              {
                "uuid": "14df1730-f7d2-4ab4-a580-865ef2a312a7",
                "control-id": "sa-9",
                "description": "CivicActions does not have any dedicated interconnections between information system components within the authorization boundary and external third-party vendor information systems for the purposes of storing, processing or transmitting federal agency data."
              },
              {
                "uuid": "ab1dc3dc-52a6-44f0-b4b3-0f0d73102932",
                "control-id": "sc-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a system and communication policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions System and Communications Protection (SC) Policy CivicActions document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>."
              },
              {
                "uuid": "b0891726-cd01-4842-bd37-006d2013e874",
                "control-id": "sc-13",
                "description": "The information system implements:\n\n- Cryptographic modules through Secure Shell (SSH) to allow administrators to securely logon to the various system components\n- HTTPS/SSL (TLS) for connection to web-based services\n- TLS for connection to email services\n- AES-256 (FIPS 140-2 validated) for data at rest (with Elastic Block Store (EBS) volumes)"
              },
              {
                "uuid": "77f4fe98-831c-499e-bd5b-ed54137d4805",
                "control-id": "sc-20",
                "description": "The system inherits this control from the FedRAMP Provisional ATO granted to the AWS Cloud dated 1 May 2013 for the following: secure name / address resolution service (authoritative source)"
              },
              {
                "uuid": "cdb6a761-3ca1-432f-ad8d-fed74a8ffe66",
                "control-id": "sc-21",
                "description": "The system inherits this control from the FedRAMP Provisional ATO granted to the AWS Cloud dated 1 May 2013 for the following: secure name / address resolution service (recursive or caching resolver)"
              },
              {
                "uuid": "5f50f5cb-c480-4427-adfc-fb8658bb72d7",
                "control-id": "sc-22",
                "description": ""
              },
              {
                "uuid": "3d08bad9-8c5d-4930-a61f-bbf577ab96b8",
                "control-id": "sc-39",
                "description": "Process isolation is maintained on the Linux platform. Linux is the only operating system that is part of the boundary."
              },
              {
                "uuid": "ede43ae1-c4fe-465c-b459-ec54f339aa55",
                "control-id": "si-1",
                "description": "CivicActions has developed, documented and disseminated to personnel a system and information integrity policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions System and Information Integrity (SI) Policy document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>."
              },
              {
                "uuid": "3182dc9a-54bc-4d39-9e51-e6605be28b4b",
                "control-id": "si-2",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "si-2_smt.a",
                    "uuid": "717ef18c-690f-4f66-ba34-f10dd1dd52da",
                    "description": "Identification of information system security flaws are detected as early as possible by the following methods:\n\n- Vulnerability scans, as described in RA-5.\n- Log analysis from monitoring described in SI-4.\n- Service flaw notifications (CVEs, etc.) are received by the\n  CivicActions Security Office and passed on to\n  CivicActions Operations staff when relevant.\n\nAny security issues found are ticketed through JIRA and/or the Git issue queue. CivicActions Operations staff prioritizes high findings. Changes made to correct the information system as a result of the system flaws are scheduled and coordinated through the CCB Change Request Process and appropriate approvals required from the CCB as implemented in CM-3."
                  },
                  {
                    "statement-id": "si-2_smt.b",
                    "uuid": "529ddb68-080e-4a8e-b67d-3f02e3bf2de8",
                    "description": "CivicActions testing of the system as a result of security flaw remediation is done through a development environment through the use of internal software and automated testing that ensures the system is working as intended. When a change is made by a developer, testing though a peer review is conducted as part of the Change Request process to ensure the correct analysis is completed. Then the changed code is tested in an automatic test environment as described in the Configuration Management Plan (CMP). Tracking of the testing is documented in JIRA and/or the Git issue queue."
                  },
                  {
                    "statement-id": "si-2_smt.c",
                    "uuid": "efbd0ba2-5003-42ed-b3ba-83c6f802714c",
                    "description": "CivicActions security-software updates are tested prior to implementation on production. The CivicActions Security framework for installation requires updates to be made within 30 days for high vulnerabilities, 90 days for moderate vulnerabilities, and 240 for low vulnerabilities. An issue ticket is created to track any updates made to the system."
                  },
                  {
                    "statement-id": "si-2_smt.d",
                    "uuid": "7c4d115d-8431-4ced-bdc1-6660f2f962e6",
                    "description": "Flaw remediation is part of the CivicActions configuration management process. Any security issues found are ticketed through JIRA or the Git issue queue. The CivicActions Security Office prioritizes the high findings within the application. Changes made to correct the system as a result of the system flaws are scheduled and coordinated through the CCB Change Request Process and appropriate approvals required from the CCB Chair as implemented in CM-3."
                  }
                ]
              },
              {
                "uuid": "ab463b22-2a44-4349-a853-9fd176099306",
                "control-id": "si-3",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "si-3_smt.a",
                    "uuid": "a27e4459-b146-4fb7-a308-51a4a6262e1a",
                    "description": "Virus scans are performed by ClamAV, a server-hosted tool protecting the application from Trojans, Viruses and other malicious cyber-threats. Real-time scans are conducted whenever files are uploaded from any external source and malicious code is blocked or quarantined when detected. All file-based traffic traversing the server is sanitized before being delivered. All input form text is validated and sanitized."
                  },
                  {
                    "statement-id": "si-3_smt.b",
                    "uuid": "ca8a137a-5be0-479c-b350-eb55fe20f8fd",
                    "description": "Anti-virus definitions and malicious code protection mechanisms are configured and updated automatically on a nightly basis."
                  },
                  {
                    "statement-id": "si-3_smt.c",
                    "uuid": "94f07f4b-e6ec-4158-875f-2bc273757b02",
                    "description": "CivicActions Operations staff receives information system security alerts, advisories, and notifications in response to malicious code detection. These messages are sent to group email distribution lists to ensure all members of the team receive the proper information in a timely manner."
                  },
                  {
                    "statement-id": "si-3_smt.d",
                    "uuid": "66622efb-6bc8-4f25-b3f2-2d6a0f28d257",
                    "description": "False positives during malicious code detection and eradication are dealt with on a case by case basis. Potential impacts on the availability of the information system are detailed in a false positive report depending on if the report is for the OS, database or web application."
                  }
                ]
              },
              {
                "uuid": "71f12ded-f2d8-4187-9f7c-70ec3aa6bf2e",
                "control-id": "si-4",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "si-4_smt.a",
                    "uuid": "14bdc129-b4e8-4714-a766-56f2b414160c",
                    "description": "CivicActions systems use a collection of monitoring systems, including:\n\n- ClamAV - provides signature-based malware detection/quarantine\n- OSSEC host-based intrusion detection system (HIDS)\n- AIDE Advanced Intrusion Detection Environment (IDS))\n- fail2ban, an intrusion prevention system (IPS) framework\n- SELinux - a Mandatory Access Control (MAC) IPS\n- auditd - a secure system audit daemon\n- CloudWatch - AWS monitoring and measurement system\n- StatusCake - website monitoring tool\n- OpsGenie - a slack/email/text/phone incident escalation tool"
                  },
                  {
                    "statement-id": "si-4_smt.b",
                    "uuid": "c0e3ad30-d774-4032-b0b7-a5813bb6b7ca",
                    "description": "Logs from the systems described in SI-4(a) are sent to the CivicActions SIEM tool for analysis. These logs can identify unauthorized use of the information system."
                  },
                  {
                    "statement-id": "si-4_smt.c",
                    "uuid": "9238b695-24e1-4836-9f7f-618eadef9cec",
                    "description": "Monitoring and log collection occur throughout the system."
                  },
                  {
                    "statement-id": "si-4_smt.d",
                    "uuid": "a37a1319-8294-47ab-a88a-0d721a85cc08",
                    "description": "The Configuration Management process, remote log gathering, and SELinux MAC protects information obtained from intrusion-monitoring tools from unauthorized access, modification, and deletion."
                  },
                  {
                    "statement-id": "si-4_smt.e",
                    "uuid": "ede3489e-46a6-481e-bf5d-65a286a54b5a",
                    "description": "In the event of a performance score lower than CivicActions standards, a notification is sent to the CivicActions Security Office. CivicActions subscribes to security mailing lists in the event the monitoring activity is required based on law enforcement information, intelligence information, or other credible sources of information."
                  },
                  {
                    "statement-id": "si-4_smt.f",
                    "uuid": "38318905-de19-4a13-ad8b-08ff73fdf3f1",
                    "description": "Internal legal counsel is utilized as required when system notifications indicate such action based on user and/or malicious activity. Legal counsel is engaged for any actions that may necessitate increased user monitoring or evidence/forensic actions."
                  },
                  {
                    "statement-id": "si-4_smt.g",
                    "uuid": "08aade6e-2e50-4444-adef-18d9327519e8",
                    "description": "System alerts generated by CivicActions internal monitors (StatusCake, OSSEC, ClamAV, others) are sent to the Incident Response team via OpsGenie."
                  }
                ]
              },
              {
                "uuid": "3aacd0ed-b004-427b-99ec-d61694e5888f",
                "control-id": "si-5",
                "description": "Requirements are implemented as described in the included statements.",
                "statements": [
                  {
                    "statement-id": "si-5_smt.a",
                    "uuid": "05a4707c-5870-4d68-a4a1-fa16d3418690",
                    "description": "The CivicActions Security Office and Operations staff receive the following security alerts, advisories, and directives on an ongoing basis:\n\n- Mailing lists relevant to web application security\n- US-CERT\n- Technical Cyber Security Alerts\n- Drupal Security Advisories"
                  },
                  {
                    "statement-id": "si-5_smt.b",
                    "uuid": "b9048f23-2e9b-4bd0-a9e2-12ac743fa2b2",
                    "description": "CivicActions utilizes StatusCake for front line monitoring for real time system status and events of the application. StatusCake can feed to the OpsGenie incident escalation system."
                  },
                  {
                    "statement-id": "si-5_smt.c",
                    "uuid": "3171a00a-dd62-46a3-9d3d-95ca5889baf9",
                    "description": "The CivicActions Security Office disseminates security alerts, advisories, and directives to all CivicActions internal personnel and client personnel as directed."
                  },
                  {
                    "statement-id": "si-5_smt.d",
                    "uuid": "afdab2a9-bfe5-4672-9a18-56006bcd1017",
                    "description": "The CivicActions Security Office is responsible for ensuring the dissemination and implementation of relevant security alerts and advisories."
                  }
                ]
              },
              {
                "uuid": "16b10365-f963-435e-8df5-9d75956b3684",
                "control-id": "si-12",
                "description": "The CivicActions organization retains all information, system-related information, incident-related information, and system output in accordance with customers’ requirements retention periods and other NIST guidance and standards, Federal policies, procedures, federal laws, and executive orders. Audit records are retained for 365 days."
              }
            ]
          }
        ]
      }
    ]
  }
}
